Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/** @brief Bench-test I2C bus config for a GY-521 / MPU-6050 at 0x68 on RIIC1. */
static rx_bus_config_t s_i2c1_mpu_config;

/**
 * @var g_bus_manager
 * @brief Single file-scope forward declaration of the global bus manager singleton
 *
 * @details
 * The bus manager itself is defined in rx_bus_manager.c. This translation unit
 * only needs a forward declaration so internal_init_bus_manager(),
 * internal_register_system_buses(), and their extracted helpers can share the
 * same symbol without each repeating an `extern` line (which clang-tidy flags
 * as redundant under readability-redundant-declaration).
 *
 * @note Single-threaded use only inside tx_application_define() (pre-scheduler).
 * @see rx_bus_manager_init() Definition / lifetime owner
 * @since Version 1.0.0
 */
extern rx_bus_manager_t g_bus_manager;

/**
 * @enum dflash_fcu_cmd_t
 * @brief RX72N Flash Control Unit (FCU) command opcodes for data-flash P/E
 *
 * @details
 * Single-byte opcodes written to the FACI command area to drive the FCU
 * state machine for data-flash erase and program operations. Sourced from
 * RX72N HW manual R01UH0824EJ0111 Ch 62 (Flash Memory), Tables 62.6/62.7.
 *
 * The terminator byte (0xD0) finalizes the command sequence and tells the
 * FCU to begin executing the requested operation.
 */
typedef enum : uint8_t {
  k_dflash_fcu_cmd_block_erase = 0x20U, /**< Block erase opcode (Ch 62.9.3.5) */
  k_dflash_fcu_cmd_program     = 0xE8U, /**< Program opcode (Ch 62.9.3.4) */
  k_dflash_fcu_cmd_terminator  = 0xD0U, /**< Command terminator -- launches op */
  k_dflash_fcu_program_words   = 0x02U, /**< N parameter for program: 2 x 16-bit words = 4 bytes */
  k_dflash_fwepror_enable_pe   = 0x01U, /**< FWEPROR.FLWE = 1 -- allow P/E ops */
} dflash_fcu_cmd_t;

/**
 * @enum dflash_fentryr_t
 * @brief RX72N FENTRYR (Flash P/E Mode Entry) control values
 *
 * @details
 * 16-bit writes to FENTRYR control entry/exit of flash program/erase mode.
 * Upper byte 0xAA is the unlock key (FEKEY); lower byte selects target area.
 * Per RX72N HW manual Ch 62, Section 62.4.2 (FENTRYR register).
 */
typedef enum : uint16_t {
  k_dflash_fentryr_enter_dataflash_pe = 0xAA80U, /**< Enter data-flash P/E mode (FENTRYD=1) */
  k_dflash_fentryr_exit_pe            = 0xAA00U, /**< Exit P/E mode (read mode) */
  k_dflash_fentryr_low_byte_mask      = 0x00FFU, /**< Mask to read FENTRYR status (low byte) */
  k_dflash_fentryr_pe_active = 0x0080U, /**< Low-byte value indicating data-flash P/E mode active */
  k_dflash_fentryr_pe_inactive = 0x0000U, /**< Low-byte value indicating P/E mode exited */
} dflash_fentryr_t;

/**
 * @enum dflash_fpckar_t
 * @brief RX72N FPCKAR (Flash Peripheral Clock Notification) construction values
 *
 * @details
 * 16-bit writes to FPCKAR notify the FCU of the FCLK frequency in MHz so the
 * internal P/E timing converges. The register format is:
 *   bits[15:8] = key 0x1E (upper byte)
 *   bits[7:0]  = FCLK frequency in MHz (lower byte)
 *
 * Values from this single enum must be OR'd together to form the final 16-bit
 * register write. Keeping the key and the MHz constant in one enum (rather
 * than two) avoids `bugprone-suspicious-enum-usage` because both operands of
 * the OR are now from the same enum type. Per RX72N HW manual Ch 62 (Flash
 * Memory), Section 62.4.4 (FPCKAR register).
 */
typedef enum : uint16_t {
  k_dflash_fpckar_key      = 0x1E00U, /**< FPCKAR key (upper byte 0x1E); OR'd with FCLK MHz */
  k_dflash_fpckar_fclk_mhz = 60U,     /**< FCLK frequency in MHz (OR'd with FPCKAR key) */
} dflash_fpckar_t;

/**
 * @enum dflash_probe_layout_t
 * @brief Magic header bytes for the bench dflash probe
 *
 * @details
 * The bench probe writes a 4-byte payload to data flash so rfp-cli can
 * verify the firmware ran without needing a UART bridge. The first two
 * bytes are a fixed sentinel pattern; bytes 2-3 carry runtime data.
 */
typedef enum : uint8_t {
  k_dflash_probe_magic_byte0 = 0xA5U, /**< Sentinel byte 0 (LE: at addr+0) */
  k_dflash_probe_magic_byte1 = 0x5AU, /**< Sentinel byte 1 (LE: at addr+1) */
  k_dflash_probe_byte_mask   = 0xFFU, /**< Mask to extract low byte of 32-bit error code */
} dflash_probe_layout_t;

/**
 * @enum fcu_poll_iters_t
 * @brief Bounded poll iteration counts for FCU state-machine waits
 *
 * @details
 * NASA P10 Rule 2 requires fixed loop bounds. These values cap waits on
 * FENTRYR/FSTATR.FRDY transitions; values are empirically large enough
 * that the FCU completes the slowest operation (block erase) well within
 * the cap at 60 MHz FCLK.
 */
typedef enum : uint32_t {
  k_fcu_poll_short = 100000U,  /**< Mode entry/exit + FRDY wait (~1.7 ms @ 60 MHz) */
  k_fcu_poll_long  = 1000000U, /**< Erase/program completion wait (~17 ms @ 60 MHz) */
} fcu_poll_iters_t;

/**
 * @enum main_prcr_key_t
 * @brief RX72N PRCR (Protect Register) key/unlock values
 *
 * @details
 * The PRCR upper byte (0xA5) is the protection key; the low nibble enables
 * write access to specific protected register groups. Required before
 * touching MSTPCR* and clock-tree registers. Per RX72N HW manual Ch 13.2.1.
 */
typedef enum : uint16_t {
  k_main_prcr_unlock_clock_lpm =
    0xA503U,                      /**< Key 0xA5 + PRC0 | PRC1: unlock clock + low-power-mode regs */
  k_main_prcr_lock_all = 0xA500U, /**< Key 0xA5 + all PRC bits cleared: re-lock everything */
} main_prcr_key_t;

/**
 * @enum usb_init_delay_iters_t
 * @brief Busy-loop iteration counts used during pre-kernel USB0 bring-up
 *
 * @details
 * Empirically tuned for ICLK = 240 MHz: ~10 ms spin per phase. Used to
 * straddle the SYSCFG -> SCKE -> USBE ordering required by HUM 40.3.1.1
 * (the RX72N USB module needs internal clock to settle before USBE=1).
 */
typedef enum : uint32_t {
  k_usb_syscfg_settle_nops = 2400000U, /**< ~10 ms spin between SYSCFG / SCKE / USBE writes */
} usb_init_delay_iters_t;

/**
 * @enum usb_inline_addr_t
 * @brief Absolute addresses of USB0 / system / ICU / PORTB registers touched
 *        directly by the pre-kernel inline USB0 bring-up
 *
 * @details
 * These mirror constants already named in
 * `libs/rx_hal/inc/rx72n_{usb,system,icu,port}_regs.h`. Repeating them here
 * keeps `main.c` self-contained for the early bring-up code without losing
 * the "no magic numbers" rule. Values cross-checked against:
 *   - PRCR     -> rx72n_system_regs.h:161   (`k_prcr_addr`)
 *   - MSTPCRB  -> rx72n_system_regs.h:1249  (offset 0x14 from system base 0x00080000)
 *   - SYSCFG   -> rx72n_usb_regs.h:231      (`k_usb0_base_addr` + 0x00)
 *   - DPUSR0R  -> rx72n_usb_regs.h:237      (`k_usb_dpusr0r_addr`)
 *   - PHYSLEW  -> rx72n_usb_regs.h:87       (USB0 base + 0xF0)
 *   - INTENB0  -> rx72n_usb_regs.h:56       (USB0 base + 0x30)
 *   - BRDYENB  -> rx72n_usb_regs.h:58       (USB0 base + 0x36)
 *   - BEMPENB  -> rx72n_usb_regs.h:60       (USB0 base + 0x3A)
 *   - DCPCFG/DCPMAXP/DCPCTR -> rx72n_usb_regs.h:74-76 (USB0 base + 0x5C..0x60)
 *   - ICU IR/IER/IPR/SLIBR/SLIPRCR -> rx72n_icu_regs.h:191,358-443
 *
 * @note `uintptr_t` underlying type is mandatory for register addresses
 *       (CLAUDE.md "Constants and Macros" rule -- ensures correct width on
 *       both 32-bit RX72N target and 64-bit unit-test host).
 */
typedef enum : uintptr_t {
  k_inline_addr_prcr      = 0x000803FEU, /**< PRCR (Protect Register), 16-bit */
  k_inline_addr_mstpcrb   = 0x00080014U, /**< MSTPCRB Module Stop Ctrl Reg B, 32-bit */
  k_inline_addr_syscfg    = 0x000A0000U, /**< USB0.SYSCFG, 16-bit */
  k_inline_addr_intenb0   = 0x000A0030U, /**< USB0.INTENB0, 16-bit */
  k_inline_addr_brdyenb   = 0x000A0036U, /**< USB0.BRDYENB, 16-bit */
  k_inline_addr_bempenb   = 0x000A003AU, /**< USB0.BEMPENB, 16-bit */
  k_inline_addr_dcpcfg    = 0x000A005CU, /**< USB0.DCPCFG, 16-bit */
  k_inline_addr_dcpmaxp   = 0x000A005EU, /**< USB0.DCPMAXP, 16-bit */
  k_inline_addr_dcpctr    = 0x000A0060U, /**< USB0.DCPCTR, 16-bit */
  k_inline_addr_physlew   = 0x000A00F0U, /**< USB0.PHYSLEW, 32-bit */
  k_inline_addr_dpusr0r   = 0x000A0400U, /**< USB.DPUSR0R (absolute), 32-bit */
  k_inline_addr_icu_ir    = 0x00087000U, /**< ICU IR000-IR255 base */
  k_inline_addr_icu_ier   = 0x00087200U, /**< ICU IER02-IER1F base */
  k_inline_addr_icu_ipr   = 0x00087300U, /**< ICU IPR000-IPR255 base */
  k_inline_addr_icu_slibr = 0x00087700U, /**< ICU SLIBR table base (vec 144 entry @ +0x90) */
  k_inline_addr_sliprcr   = 0x00087A00U, /**< ICU SLIPRCR write-protect register */
  k_inline_addr_pb_pdr    = 0x0008C00BU, /**< PORTB.PDR  (Port Direction)         */
  k_inline_addr_pb_podr   = 0x0008C02BU, /**< PORTB.PODR (Port Output Data)       */
  k_inline_addr_pb_pmr    = 0x0008C06BU, /**< PORTB.PMR  (Port Mode: 0=GPIO)      */
} usb_inline_addr_t;

/**
 * @enum usb_inline_bit_t
 * @brief Bit-mask values used by the pre-kernel inline USB0 bring-up
 *
 * @details
 * Single-bit selectors written into 16-/32-bit USB or ICU registers. Mirrors
 * `k_usb_syscfg_*` (rx72n_usb_regs.h) and `k_mstpb_usb0` (rx72n_system_regs.h)
 * but groups the bits actually touched by the inline bring-up. Grouping by
 * "register family" (SYSCFG, MSTPCRB, INTENB0, DPUSR0R, DCPCTR, BEMPENB,
 * BRDYENB, PORTB-PB3) avoids `bugprone-suspicious-enum-usage` violations
 * because we never OR these masks across families.
 *
 * `uint32_t` underlying type chosen to match the widest target register
 * (MSTPCRB / DPUSR0R / PHYSLEW are 32-bit) and so a single `(1U << n)`
 * literal stays representable.
 *
 * @note CLAUDE.md "Constants and Macros" mandates explicit underlying type
 *       for every enum.
 */
typedef enum : uint32_t {
  /* MSTPCRB bits */
  k_inline_bit_mstpb_usb0 = (1UL << 19), /**< MSTPB19: USB0 module stop */

