Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* SYSCFG (USB0) bits */
  k_inline_bit_syscfg_usbe  = (1U << 0),  /**< SYSCFG.USBE   bit 0  */
  k_inline_bit_syscfg_dprpu = (1U << 4),  /**< SYSCFG.DPRPU  bit 4  */
  k_inline_bit_syscfg_scke  = (1U << 10), /**< SYSCFG.SCKE   bit 10 */

  /* DPUSR0R bits */
  k_inline_bit_dpusr0r_fixphy0 = (1U << 4), /**< DPUSR0R.FIXPHY0 bit 4 */

  /* INTENB0 bits (HUM 40.4.5: VBSE | RSME | SOFE | DVSE | CTRE) */
  k_inline_bit_intenb0_vbse = (1U << 15), /**< VBSE: VBUS detection enable */
  k_inline_bit_intenb0_rsme = (1U << 12), /**< RSME: resume signal enable  */
  k_inline_bit_intenb0_sofe = (1U << 11), /**< SOFE: SOF received enable   */
  k_inline_bit_intenb0_dvse = (1U << 10), /**< DVSE: device-state-change   */
  k_inline_bit_intenb0_ctre = (1U << 8),  /**< CTRE: control transfer end  */

  /* PORTB.{PDR,PODR,PMR} -- PB3 mask */
  k_inline_bit_pb3 = (1U << 3), /**< PORTB pin 3 (LED EN3D probe)        */
} usb_inline_bit_t;

/**
 * @enum usb_inline_value_t
 * @brief Whole-register values written by the pre-kernel inline USB0 bring-up
 *
 * @details
 * Used for register fields that are programmed with a multi-bit pattern
 * rather than a single mask. Kept as `uint16_t` because every consumer is a
 * 16-bit USB register write (DCPCFG, DCPMAXP, DCPCTR, BRDYENB, BEMPENB,
 * SYSCFG-clear). PHYSLEW is 32-bit and gets its own constant.
 */
typedef enum : uint16_t {
  k_inline_val_syscfg_clear   = 0x0000U, /**< Clear all SYSCFG bits before SCKE */
  k_inline_val_dcpcfg         = 0x0000U, /**< DCPCFG = 0 (default ctrl pipe)    */
  k_inline_val_dcpmaxp_64     = 64U,     /**< 64-byte EP0 max packet size       */
  k_inline_val_dcpctr_pid_buf = 0x0001U, /**< DCPCTR PID = BUF (ack outstanding) */
  k_inline_val_brdyenb_pipe0  = 0x0001U, /**< BRDYENB: enable pipe 0 (DCP)      */
  k_inline_val_bempenb_pipe0  = 0x0001U, /**< BEMPENB: enable pipe 0 (DCP)      */
} usb_inline_value_t;

/**
 * @enum usb_inline_physlew_t
 * @brief PHYSLEW (32-bit) trim value used during pre-kernel USB0 bring-up
 *
 * @details
 * Mirrors `internal_usb_configure_phy()` in rx_usb_hw.c -- bits 0/2 set
 * (SLEWR00 | SLEWF00) configure the RX72N PHY slew rate per Renesas FSP
 * defaults / hirakuni45 RX600 driver.
 */
typedef enum : uint32_t {
  k_inline_val_physlew = 0x00000005U, /**< SLEWR00 | SLEWF00 default trim */
} usb_inline_physlew_t;

/**
 * @enum usb_inline_icu_t
 * @brief ICU vector / source / priority constants for inline USB0 bring-up
 *
 * @details
 * USBI0 is a Group-B software-configurable interrupt -- vector 144 must be
 * routed via SLIBR[144]=62 (HUM Table 15.3 source code) before IPR/IER do
 * anything. IER index = vector / 8, IER bit = vector % 8.
 *
 * Grouped under `uint8_t` because all values fit in a byte register (IPR is
 * 8-bit, IER is 8-bit, SLIBR is 8-bit, source codes are 0-255).
 */
typedef enum : uint8_t {
  k_inline_icu_usbi0_vector  = 144U,  /**< Vector 144 = USBI0 (HUM 15.7.7) */
  k_inline_icu_usbi0_src     = 62U,   /**< SLIBR source code for USBI0     */
  k_inline_icu_usbi_priority = 12U,   /**< IPR144 priority (IPL=12)        */
  k_inline_icu_ier_idx_usbi  = 18U,   /**< IER18  = vector 144 / 8         */
  k_inline_icu_ier_bit_usbi  = 0U,    /**< IER18 bit 0 = vector 144 % 8    */
  k_inline_icu_sliprcr_wprc  = 0x01U, /**< SLIPRCR.WPRC: write-once latch */
} usb_inline_icu_t;

/**
 * @enum usb_inline_poll_t
 * @brief Bounded-poll iteration counts used in the inline USB0 bring-up
 *
 * @details
 * Caps loop iterations per NASA P10 Rule 2 ("fixed loop upper bounds").
 * `uint16_t` is sufficient -- WPRC latches in 1-2 ICLK cycles so 1024
 * iterations is far above worst-case.
 */
typedef enum : uint16_t {
  k_inline_sliprcr_poll_max = 1024U, /**< Max poll iters for HUM 15.7.7 step (6) */
} usb_inline_poll_t;

/**
 * @enum dflash_fstatr_bit_t
 * @brief FSTATR bit masks used by `internal_bench_dflash_write()`
 *
 * @details
 * Mirrors `k_fstatr_frdy` from `libs/rx_hal/inc/rx72n_flash_regs.h:455`.
 * Repeated here so the bench dflash probe is self-contained and the FCU
 * busy-poll loops do not embed a `(1UL << 15)` literal.
 */
typedef enum : uint32_t {
  k_dflash_fstatr_frdy = (1UL << 15), /**< FSTATR.FRDY bit 15: Flash Ready */
} dflash_fstatr_bit_t;

/**
 * @enum dflash_addr_t
 * @brief Absolute MMIO addresses of FCU registers and the data-flash probe slot
 *
 * @details
 * Sourced from RX72N HW manual R01UH0824EJ0111 Ch 62 (Flash Memory). The
 * bench probe writes the {magic, who_am_i, err} payload to the dedicated
 * data-flash slot at `k_dflash_probe_addr` so `rfp-cli -rv 0x00100000 16`
 * can recover the result without requiring a UART. Note that FACI_B and
 * FACI_W share the same base (the FCU command port is byte-or-word
 * addressable).
 *
 * @note `uintptr_t` underlying type is mandatory for register addresses
 *       (CLAUDE.md "Constants and Macros" rule -- ensures correct width on
 *       both 32-bit RX72N target and 64-bit unit-test host).
 */
typedef enum : uintptr_t {
  k_dflash_addr_fstatr  = 0x007FE080U, /**< Flash Status Register, 32-bit */
  k_dflash_addr_fentryr = 0x007FE084U, /**< Flash P/E Mode Entry, 16-bit */
  k_dflash_addr_fsaddr  = 0x007FE030U, /**< Flash Start Address, 32-bit */
  k_dflash_addr_fpckar  = 0x007FE0E4U, /**< Flash Peripheral Clock Notify, 16-bit */
  k_dflash_addr_fwepror = 0x0008C296U, /**< Flash P/E Erase/Write Protect, 8-bit */
  k_dflash_addr_faci    = 0x007E0000U, /**< FACI command port, byte/word access */
  k_dflash_probe_addr   = 0x00100000U, /**< Bench probe payload slot in data-flash */
} dflash_addr_t;

/* =============================================================================
 * Bench probe: write {magic, who_am_i, err} to data flash @ k_dflash_probe_addr
 * so that rfp-cli -rv 0x00100000 16 can read the result without a UART. No
 * dependency on rx_hal flash driver -- hand-rolled FCU sequence per RX72N HW
 * manual Ch 62. The end-to-end sequence is broken into the helpers below
 * (clock setup -> P/E enter -> erase -> program -> P/E exit) so each phase
 * stays under the clang-tidy function-size threshold and can be reasoned
 * about in isolation.
 * ========================================================================= */

/**
 * @brief Busy-poll FSTATR.FRDY = 1 with a fixed loop bound (NASA P10 Rule 2)
 *
 * @details
 * Spins on the FCU's FSTATR.FRDY bit waiting for "ready". Used after every
 * FCU command (erase, program) to wait for completion. The caller passes a
 * static iteration cap from `fcu_poll_iters_t` so erase/program operations
 * (which take longer than mode entry) can use a larger bound. The body is
 * intentionally empty -- progress is observable via the loop guard.
 *
 *
 * @pre `fstatr` points to FSTATR (`k_dflash_addr_fstatr`)
 * @pre `max_iters` matches the worst-case FCU operation duration
 *
 * @post FRDY observed = 1, OR loop exited at `max_iters` (best-effort).
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_wait_frdy(volatile const uint32_t* fstatr, uint32_t max_iters)
{
  for (uint32_t i = 0; i < max_iters && ((*fstatr) & k_dflash_fstatr_frdy) == 0U; i++) {
  }
}

/**
 * @brief Configure FCU clock notification (FWEPROR + FPCKAR) before P/E mode
 *
 * @details
 * Runs the two writes that MUST happen before `*FENTRYR = ...`, otherwise the
 * FCU silently rejects every subsequent command:
 *   1. `FWEPROR = 0x01` -- enable P/E operations (FLWE)
 *   2. `FPCKAR = 0x1E00 | 60` -- notify FCU that FCLK = 60 MHz
 *
 * Both `k_dflash_fpckar_key` and `k_dflash_fpckar_fclk_mhz` live in a single
 * `dflash_fpckar_t` enum so the OR satisfies `bugprone-suspicious-enum-usage`.
 *
 *
 * @pre Pointers refer to the canonical addresses in `dflash_addr_t`
 * @pre PCLKB = 60 MHz (`k_dflash_fpckar_fclk_mhz` matches actual clock)
 *
 * @post FWEPROR.FLWE = 1 (P/E ops enabled)
 * @post FPCKAR programmed to (key | MHz) so FCU timing is correct
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_setup_clock(volatile uint8_t* fwepror, volatile uint16_t* fpckar)
{
  /* Enable P/E operations. */
  *fwepror = k_dflash_fwepror_enable_pe;

  /* Notify FCU of FCLK = 60 MHz (key 0x1E00 | freq_in_MHz). Must be done
   * BEFORE entering P/E mode or FCU silently rejects every command. Both
   * operands are members of `dflash_fpckar_t`, so the OR is enum-correct
   * (no `bugprone-suspicious-enum-usage`). */
  *fpckar = (uint16_t)(k_dflash_fpckar_key | k_dflash_fpckar_fclk_mhz);
}

/**
 * @brief Enter data-flash program/erase mode and wait for FCU ready
 *
 * @details
 * Writes the FENTRYR unlock key + dataflash-PE bit, then bounded-spins until
 * the FENTRYR low byte reads back the "P/E active" pattern (0x80) AND
 * FSTATR.FRDY latches high. Two separate polls are required because the FCU
 * acknowledges mode entry slightly before it advertises ready.
 *
 *
 * @pre `internal_dflash_setup_clock()` already ran (FCU knows PCLKB)
 *
 * @post FENTRYR low byte = 0x80 (data-flash P/E active), best-effort
 * @post FSTATR.FRDY = 1, best-effort within `k_fcu_poll_short`
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_enter_pe(volatile uint16_t* fentryr, volatile const uint32_t* fstatr)
{
  /* Enter data flash P/E mode. */
  *fentryr = k_dflash_fentryr_enter_dataflash_pe;
  /* Spin until data-flash P/E mode is active (FENTRYR low byte = 0x80). */
  for (uint32_t i = 0; i < k_fcu_poll_short &&
                       (*fentryr & k_dflash_fentryr_low_byte_mask) != k_dflash_fentryr_pe_active;
       i++) {
  }
  /* Wait for FRDY. */
  internal_dflash_wait_frdy(fstatr, k_fcu_poll_short);
}

/**
 * @brief Erase the 64-byte data-flash block containing the probe slot
 *
 * @details
 * Writes the block-erase opcode pair (0x20 then 0xD0 terminator) to FACI
 * after seeding FSADDR with the probe address. The FCU operates on whole
 * 64-byte blocks regardless of the requested length; `k_dflash_probe_addr`
 * is block-aligned so the entire block is erased back to 0xFF.
 *
 *
 * @pre `internal_dflash_enter_pe()` already ran (P/E mode active)
 *
 * @post Block at `k_dflash_probe_addr` is erased (cells = 0xFF), best-effort
 * @post FSTATR.FRDY = 1, best-effort within `k_fcu_poll_long`
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_erase_block(volatile uint32_t*       fsaddr,
                                        volatile uint8_t*        faci_b,
                                        volatile const uint32_t* fstatr)
{
  /* Erase the 64-byte block containing k_dflash_probe_addr. */
  *fsaddr = (uint32_t)k_dflash_probe_addr;
  *faci_b = k_dflash_fcu_cmd_block_erase;
  *faci_b = k_dflash_fcu_cmd_terminator;
  internal_dflash_wait_frdy(fstatr, k_fcu_poll_long);
}

/**
 * @brief Program the 4-byte {magic, who_am_i, err} payload into data flash
 *
 * @details
 * Writes 4 bytes (= 2 x 16-bit words) starting at `k_dflash_probe_addr`:
 *   bytes 0..1 = sentinel pattern 0xA5 0x5A (little-endian: word0)
 *   byte  2   = `who_am_i`
 *   byte  3   = low byte of `err` (or 0x00 if `err` is 0)
 *
 * The FCU program command (0xE8) takes an N parameter giving the number of
 * 16-bit words to program (here `k_dflash_fcu_program_words` = 2), followed
 * by the word data, terminated by 0xD0.
 *
 *
 * @pre `internal_dflash_erase_block()` already ran (slot is 0xFF / writable)
 *
 * @post 4 bytes at `k_dflash_probe_addr` programmed, best-effort
 * @post FSTATR.FRDY = 1, best-effort within `k_fcu_poll_long`
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_program_payload(volatile uint32_t*       fsaddr,
                                            volatile uint8_t*        faci_b,
                                            volatile uint16_t*       faci_w,
                                            volatile const uint32_t* fstatr,
                                            uint8_t                  who_am_i,
                                            int32_t                  err)
{
  /* Program 4 bytes: [0xA5, 0x5A, who_am_i, err_byte_low]. */
  const uint8_t  err_byte = (err == 0) ? 0x00U : (uint8_t)(err & k_dflash_probe_byte_mask);
  const uint16_t word0    = (uint16_t)(((uint16_t)k_dflash_probe_magic_byte1 << 8) |
                                    k_dflash_probe_magic_byte0); /* LE: bytes 0=A5, 1=5A */
  const uint16_t word1 = (uint16_t)(((uint16_t)err_byte << 8) | who_am_i); /* LE: 2=who, 3=err    */

  *fsaddr = (uint32_t)k_dflash_probe_addr;
  *faci_b = k_dflash_fcu_cmd_program;
  *faci_b = k_dflash_fcu_program_words;
  *faci_w = word0;
  *faci_w = word1;
  *faci_b = k_dflash_fcu_cmd_terminator;
  internal_dflash_wait_frdy(fstatr, k_fcu_poll_long);
}

/**
 * @brief Exit data-flash program/erase mode and wait for FCU to confirm
 *
 * @details
 * Writes the FENTRYR unlock-key-only pattern (0xAA00) to drop back to read
 * mode, then bounded-spins until the FENTRYR low byte reads back the
 * "P/E inactive" pattern (0x00). After this call, normal CPU reads of the
 * data-flash region are permitted again.
 *
 *
 * @pre All FCU commands (erase + program) have completed
 *
 * @post FENTRYR low byte = 0x00 (P/E mode inactive), best-effort
 * @post Data-flash readable via normal CPU loads
 *
 * @note Single-threaded use only -- runs in the pre-scheduler bring-up window.
 *
 * @since Version 1.0.0
 */
static void internal_dflash_exit_pe(volatile uint16_t* fentryr)
{
  /* Exit P/E mode. */
  *fentryr = k_dflash_fentryr_exit_pe;
  for (uint32_t i = 0; i < k_fcu_poll_short &&
                       (*fentryr & k_dflash_fentryr_low_byte_mask) != k_dflash_fentryr_pe_inactive;
       i++) {
  }
}

static void internal_bench_dflash_write(uint8_t who_am_i, int32_t err)
{
  volatile uint32_t* const fstatr  = (volatile uint32_t*)k_dflash_addr_fstatr;
  volatile uint16_t* const fentryr = (volatile uint16_t*)k_dflash_addr_fentryr;
  volatile uint32_t* const fsaddr  = (volatile uint32_t*)k_dflash_addr_fsaddr;
  volatile uint16_t* const fpckar  = (volatile uint16_t*)k_dflash_addr_fpckar;
  volatile uint8_t* const  fwepror = (volatile uint8_t*)k_dflash_addr_fwepror;
  volatile uint8_t* const  faci_b  = (volatile uint8_t*)k_dflash_addr_faci;
  volatile uint16_t* const faci_w  = (volatile uint16_t*)k_dflash_addr_faci;

  internal_dflash_setup_clock(fwepror, fpckar);
  internal_dflash_enter_pe(fentryr, fstatr);
  internal_dflash_erase_block(fsaddr, faci_b, fstatr);
  internal_dflash_program_payload(fsaddr, faci_b, faci_w, fstatr, who_am_i, err);
  internal_dflash_exit_pe(fentryr);
}

