Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* Compute result reflecting actual register state */
  const bool result = (rstsr2_val & flag_mask) == 0;

  return result;
}

/**
 * @brief Check Independent Watchdog Timer Reset Detect Flag (IWDTRF) - CRITICAL safety check
 *
 * @details
 * Reads the **RSTSR2.1 (IWDTRF)** bit to detect if the **current boot** was caused by an
 * **Independent Watchdog Timer (IWDT) timeout**. IWDT timeout is a **critical firmware error**
 * indicating the prior execution hung, deadlocked, or failed to refresh the watchdog.
 *
 * **CRITICAL:** This is the **most important reset flag check**. If IWDTRF=1, the firmware
 * **MUST halt** immediately (via RX_ASSERT in caller) to prevent cascading failures.
 *
 * ## IWDTRF (Independent Watchdog Timer Reset Flag) Semantics
 *
 * | IWDTRF Value | Meaning | Implication | Action |
 * |--------------|---------|-------------|--------|
 * | **0 (clear)** | No IWDT reset | **Normal** - prior execution completed gracefully | [OK] boot |
 * | **1 (set)** | IWDT timeout reset | **CRITICAL BUG** - prior firmware hung/crashed | [STOP] **HALT EXECUTION** |
 *
 * ## Independent Watchdog Timer (IWDT) Overview
 *
 * **Purpose:** Detect firmware hangs, infinite loops, deadlocks
 *
 * **Configuration:**
 * - **Timeout period:** 128 ms (configured in option setting memory)
 * - **Clock source:** IWDTCLK (independent 15 kHz RC oscillator)
 * - **Refresh requirement:** Call `rx_iwdt_feed()` every 100 ms (from PID control loop)
 *
 * **Failure scenarios triggering IWDT reset:**
 * - Infinite loop (forgot `tx_thread_sleep()` in task)
 * - Deadlock (mutex wait never completes)
 * - Priority inversion (high-priority task blocked by low-priority)
 * - Hard fault (exception handler doesn't refresh watchdog)
 *
 * ## Why IWDT Timeout is Critical (vs Other Resets)
 *
 * | Reset Type | Cause | Severity | Recovery |
 * |------------|-------|----------|----------|
 * | **IWDTRF** | Firmware hang | **CRITICAL** | Must fix root cause (firmware bug) |
 * | WDTRF | WDT timeout | High | May be intentional (bootloader) |
 * | SWRF | Software reset | Low | Intentional (bootloader, debug) |
 * | LVD0RF | Brownout | Low | Power supply issue (hardware) |
 *
 * **Key insight:** IWDT timeout is **ALWAYS** a firmware bug. Unlike software reset (intentional)
 * or brownout (hardware issue), IWDT timeout has **no valid use case** except detecting hangs.
 *
 * ## Integration with Startup Check Flow
 *
 * ```
 * internal_check_startup_flags()
 *   -> internal_check_iwdtrf()
 *   -> return false if IWDTRF=1
 *   -> RX_ASSERT(iwdtrf_ok, "IWDT reset detected") -> **HALTS EXECUTION**
 * ```
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Call helper (internal_check_rstsr2_flag_clear) | ~0.7 us | Register read + mask |
 * | **Total** | **~0.7 us** | Single register check |
 *
 *
 * @pre RSTSR2 register accessible (memory-mapped at 0x000C0080)
 * @pre IWDT configured and enabled (option setting memory)
 *
 * @post Return value reflects actual IWDTRF bit state
 * @post **If false returned, caller MUST halt execution** (via RX_ASSERT)
 *
 * @note **This check is CRITICAL for firmware safety.** Never bypass or ignore IWDTRF=1.
 *       Always investigate and fix the root cause (infinite loop, deadlock, etc.).
 *
 * @note **Does not clear IWDTRF.** Flag clearing requires protection unlock (PRCR.PRC0=1)
 *       and explicit write to RSTSR2. This function is read-only.
 *
 * @warning **IWDTRF=1 ALWAYS indicates firmware bug.** Do NOT continue boot if this function
 *          returns false. Caller enforces this via RX_ASSERT (halts execution).
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No race conditions.
 *
 * @par Example Usage:
 * @code
 * // Startup validation in main():
 * bool iwdtrf_ok = internal_check_iwdtrf();
 * if (!iwdtrf_ok) {
 *   rx_log_error(s_tag, "CRITICAL: Independent Watchdog Timer reset detected");
 *   rx_log_error(s_tag, "Prior execution hung or failed to refresh watchdog");
 *   // Halt execution (fail-fast)
 *   RX_ASSERT(false, "IWDT timeout - firmware bug detected");
 * }
 * @endcode
 *
 * @par Common Root Causes (Debug Guide):
 * 1. **Infinite loop:** Check for `while(1)` without `tx_thread_sleep()`
 * 2. **Deadlock:** Check mutex acquisition order (AB-BA deadlock)
 * 3. **Priority inversion:** Low-priority task holds mutex, high-priority waits forever
 * 4. **Hard fault:** Exception handler doesn't refresh IWDT before reset
 * 5. **Missing refresh:** `rx_iwdt_feed()` not called every 100 ms from main task
 *
 * @see internal_check_rstsr2_flag_clear() Generic RSTSR2 flag checker (helper)
 * @see internal_check_startup_flags() Orchestrates all reset checks (caller)
 * @see rx_iwdt_feed() Refresh IWDT to prevent timeout (must call every 100 ms)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify IWDTRF=0 (normal boot) and IWDTRF=1 (simulated hang)
 */
static bool internal_check_iwdtrf(void)
{
  return internal_check_rstsr2_flag_clear(k_rstsr2_iwdtrf);
}

/**
 * @brief Check Watchdog Timer Reset Detect Flag (WDTRF)
 *
 * @details
 * Reads the **RSTSR2.0 (WDTRF)** bit to detect if the current boot was caused by a
 * **Watchdog Timer (WDT) timeout**. Unlike IWDTRF (critical), WDTRF may be **intentional**
 * in some scenarios (bootloader timeout, intentional watchdog reset).
 *
 * ## WDTRF (Watchdog Timer Reset Flag) Semantics
 *
 * | WDTRF Value | Meaning | Typical Cause | Action |
 * |-------------|---------|---------------|--------|
 * | **0 (clear)** | No WDT reset | Normal boot | [OK] |
 * | **1 (set)** | WDT timeout reset | Firmware hang OR intentional | [WARN] Log warning, return error |
 *
 * ## WDT vs IWDT Comparison
 *
 * | Feature | WDT (Watchdog Timer) | IWDT (Independent WDT) |
 * |---------|----------------------|------------------------|
 * | **Clock source** | PCLKB (60 MHz, shared) | IWDTCLK (15 kHz, independent) |
 * | **Disable capability** | Can be stopped in software | Cannot be stopped (always-on) |
 * | **Use case** | Intentional resets, bootloader timeout | Critical hang detection only |
 * | **Flag on reset** | WDTRF (RSTSR2.0) | IWDTRF (RSTSR2.1) |
 * | **Criticality** | [WARN] Warning (may be intentional) | [STOP] Critical (always a bug) |
 *
 * ## Interpretation and Recovery
 *
 * **Non-critical flag:** Unlike IWDTRF, WDTRF=1 does **not** assert-halt. Instead:
 * - Log warning message (diagnostic information)
 * - Return `false` to caller (indicates abnormal condition)
 * - Caller returns `k_rx_err_hw_init_failed` (non-fatal error)
 * - Boot may continue (user decides based on application requirements)
 *
 *
 * @pre RSTSR2 register accessible (memory-mapped at 0x000C0080)
 *
 * @post Return value reflects actual WDTRF bit state
 * @post Caller logs warning if false returned (non-critical error)
 *
 * @note **Does not clear WDTRF.** Flag clearing requires protection unlock and explicit write.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context).
 *
 * @see internal_check_rstsr2_flag_clear() Helper function for RSTSR2 checks
 * @see internal_check_iwdtrf() Critical IWDT check (always a bug if set)
 *
 * @since Version 1.0.0
 */
static bool internal_check_wdtrf(void)
{
  return internal_check_rstsr2_flag_clear(k_rstsr2_wdtrf);
}

/**
 * @brief Check Software Reset Detect Flag (SWRF)
 *
 * @details
 * Reads the **RSTSR2.2 (SWRF)** bit to detect if the current boot was caused by a
 * **software-initiated reset** (via SWRR register write). Software resets are often **intentional**
 * (bootloader entry, firmware update mode, debug reset) but may also indicate error recovery.
 *
 * ## SWRF (Software Reset Flag) Semantics
 *
 * | SWRF Value | Meaning | Typical Cause | Error? |
 * |------------|---------|---------------|--------|
 * | **0 (clear)** | No software reset | Normal boot or hardware reset | [OK] |
 * | **1 (set)** | Software reset executed | Bootloader, debug, or error recovery | [WARN] Context-dependent |
 *
 * ## Common Software Reset Scenarios
 *
 * **Intentional (non-error):**
 * 1. **Bootloader entry:** User button held during power-on -> software reset to bootloader mode
 * 2. **Firmware update:** Application writes to SWRR after downloading new firmware
 * 3. **Debugger reset:** OpenOCD or GDB issues reset command
 * 4. **Configuration change:** Software reset after updating option bytes
 *
 * **Error recovery (potential issue):**
 * 1. **Error handler:** Firmware detects unrecoverable error -> software reset to recover
 * 2. **Panic handler:** Hard fault exception -> software reset as last resort
 * 3. **Assert failure:** RX_ASSERT failed -> software reset instead of halt (if configured)
 *
 * ## Interpretation Strategy
 *
 * **Non-critical flag:** SWRF=1 does **not** halt execution. Instead:
 * - Log informational message (diagnostic aid)
 * - Return `false` to caller (indicates software reset occurred)
 * - Caller returns `k_rx_err_hw_init_failed` (allows boot to continue)
 * - Application logic decides if this is acceptable
 *
 *
 * @pre RSTSR2 register accessible (memory-mapped at 0x000C0080)
 *
 * @post Return value reflects actual SWRF bit state
 * @post Caller logs informational message if false returned
 *
 * @note **Software reset is not necessarily an error.** Many valid use cases (bootloader,
 *       firmware update, debug) intentionally trigger software resets.
 *
 * @note **Does not clear SWRF.** Flag clearing requires protection unlock and explicit write.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context).
 *
 * @par Example Intentional Software Reset:
 * @code
 * // Enter bootloader mode (from application):
 * void enter_bootloader(void) {
 *   rx_log_info("APP", "Entering bootloader mode via software reset");
 *
 *   // Unlock register protection
 *   system()->prcr = 0xA501;
 *
 *   // Trigger software reset
 *   system()->swrr = 0xA501;  // Write magic value to SWRR
 *
 *   // Never reached (MCU resets immediately)
 * }
 * @endcode
 *
 * @see internal_check_rstsr2_flag_clear() Helper function for RSTSR2 checks
 * @see internal_check_iwdtrf() Critical IWDT check (always a bug if set)
 *
 * @since Version 1.0.0
 */
static bool internal_check_swrf(void)
{
  return internal_check_rstsr2_flag_clear(k_rstsr2_swrf);
}

/**
 * @brief Check Voltage-Monitoring 0 Reset Detect Flag (LVD0RF) - Brownout detection
 *
 * @details
 * Reads the **RSTSR0.1 (LVD0RF)** bit to detect if the current boot was caused by a
 * **Low-Voltage Detect (LVD) reset**. LVD0RF=1 indicates the **supply voltage (VCC) dropped
 * below the configured threshold**, triggering a protective reset (brownout condition).
 *
 * ## LVD0RF (Low-Voltage Detect 0 Reset Flag) Semantics
 *
 * | LVD0RF Value | Meaning | Cause | Issue |
 * |--------------|---------|-------|-------|
 * | **0 (clear)** | No brownout reset | Voltage stable during operation | [OK] |
 * | **1 (set)** | Brownout reset occurred | VCC dropped below threshold (e.g., 2.9V) | [WARN] Power supply issue |
 *
 * ## Low-Voltage Detect (LVD) System Overview
 *
 * **Purpose:** Protect MCU from operating at insufficient voltage (data corruption, erratic behavior)
 *
 * **LVD0 Configuration:**
 * - **Threshold:** Typically 2.9V or 3.0V (configured in option setting memory)
 * - **Action:** Generate interrupt OR reset when VCC < threshold
 * - **Hysteresis:** ~100 mV (prevents oscillation at threshold boundary)
 *
 * **Common brownout causes:**
 * 1. **Inadequate power supply:** Regulator cannot provide sufficient current
 * 2. **Motor inrush current:** High current draw from motors causes voltage sag
 * 3. **Loose power connector:** Intermittent connection causes voltage drops
 * 4. **Power depletion:** Supply voltage falls below LVD threshold
 *
 * ## Brownout Detection and Recovery
 *
 * **Non-critical flag:** LVD0RF=1 indicates **hardware issue**, not firmware bug:
 * - Log warning message (power supply diagnostic)
 * - Return `false` to caller (indicates brownout occurred)
 * - Caller returns `k_rx_err_hw_init_failed` (allows boot to continue if voltage restored)
 * - Application may implement graceful shutdown or low-power mode
 *
 * ## Double-Read for Register Stability
 *
 * **Why two reads?** RSTSR0 is a volatile status register that may have transient states
 * during power-up. Reading twice and comparing ensures stable value (catches glitches).
 *
 * ```c
 * const uint8_t rstsr0_val  = regs->rstsr0;  // First read
 * const uint8_t rstsr0_val2 = regs->rstsr0;  // Second read
 * RX_ASSERT(rstsr0_val == rstsr0_val2, "Inconsistent RSTSR01 read");
 * ```
 *
 *
 * @pre RSTSR0 register accessible (memory-mapped at 0x000C001C)
 * @pre LVD0 configured and enabled (option setting memory)
 *
 * @post Return value reflects actual LVD0RF bit state
 * @post Two consecutive reads match (assert validates stability)
 * @post Caller logs warning if false returned (hardware diagnostic)
 *
 * @note **Does not clear LVD0RF.** Flag clearing requires protection unlock (PRCR.PRC0=1)
 *       and explicit write to RSTSR0.
 *
 * @note **LVD0RF=1 indicates hardware issue, not firmware bug.** Investigate power supply
 *       capacity, motor inrush current, or supply voltage.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context).
 *
 * @par Example Power Supply Issue Debugging:
 * @code
 * // Startup check:
 * bool lvd0rf_ok = internal_check_lvd0rf();
 * if (!lvd0rf_ok) {
 *   rx_log_warn(s_tag, "Brownout reset detected (VCC dropped below threshold)");
 *   rx_log_warn(s_tag, "Check power supply capacity and motor inrush current");
 *
 * }
 * @endcode
 *
 * @see internal_check_startup_flags() Orchestrates all reset checks (caller)
 * @see rstsr01() Accessor function for RSTSR0/RSTSR1 registers
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify LVD0RF=0 (normal) and LVD0RF=1 (simulated brownout)
 */
static bool internal_check_lvd0rf(void)
{
  const volatile rx_rstsr01_regs_t* regs = rstsr01();

