Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  return k_rx_ok;
}

/* =============================================================================
 * IWDT Configuration
 * =============================================================================
 */

/**
 * @enum iwdt_hardware_timeout_ms_t
 * @brief IWDT hardware watchdog timeout constants
 *
 * @details
 * Defines the hardware Independent Watchdog Timer (IWDT) timeout period.
 * This is the maximum time the system can run without feeding the watchdog
 * before triggering an automatic hardware reset. The timeout is configured
 * via the IWDT Clock Select (CKS) register setting.
 *
 * **Hardware Configuration:**
 * - CKS = 10 (PCLKB/8192 divider)
 * - PCLKB = 60 MHz
 * - Timeout period = 2048ms (+/-10% tolerance)
 *
 * **Usage:**
 * Set as `default_timeout_ms` in `rx_iwdt_config_t` during initialization.
 * Watchdog monitor task feeds the hardware watchdog at 100 Hz (10ms period).
 *
 * @invariant All values in milliseconds. Valid range: 128-16384ms per hardware limits.
 *            Hardware timeout must exceed longest task timeout to prevent spurious resets.
 *
 * @code
 * // Configure IWDT with hardware timeout
 * static const rx_iwdt_config_t s_iwdt_config = {
 *   .default_timeout_ms = k_iwdt_hw_timeout_ms,  // 2048ms hardware timeout
 *   .enable_task_monitoring = true,
 *   .reset_on_timeout = true,
 * };
 * rx_err_t err = rx_iwdt_init(&s_iwdt_config);
 * @endcode
 *
 * @note Hardware timeout must be longer than longest task timeout to prevent false resets
 * @see rx_iwdt_config_t Configuration structure using this constant
 * @see watchdog_monitor_task.c Task that feeds the hardware watchdog
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_iwdt_hw_timeout_ms =
    2048, /**< Hardware IWDT timeout in milliseconds (CKS=10, ~2048ms +/-10%). Must exceed all task timeouts to prevent spurious resets. Valid range: 128-16384ms per hardware limits. */
} iwdt_hardware_timeout_ms_t;

/**
 * @enum iwdt_state_timeout_ms_t
 * @brief IWDT state-dependent timeout constants
 *
 * @details
 * Defines software-level watchdog timeouts for each system state. These timeouts
 * determine how long the system can remain in a given state without task heartbeats
 * before the watchdog monitor triggers a reset. State-specific timeouts allow
 * longer grace periods during initialization and error recovery while maintaining
 * tight timing during normal operation.
 *
 * **State Timeout Strategy:**
 * - **Init/Idle**: 5s - Accommodates slow peripheral initialization (I2C, USB, flash)
 * - **Running/Motor/Comm**: 2s - Standard operation with 100 Hz watchdog feeding
 * - **Error**: 10s - Extended timeout for diagnostics, logging, and recovery attempts
 *
 * **Timeout Hierarchy:**
 * State timeout > Task timeout > Heartbeat interval (prevents false positives)
 *
 * @invariant All values in milliseconds. State timeouts < hardware IWDT timeout (2048ms for running states).
 *            Init/idle/error states may exceed hardware timeout (watchdog not yet started or in recovery).
 *            Valid ranges per state: init/idle (2000-10000ms), running/motor/comm (1000-2000ms), error (5000-16000ms).
 *
 * @code
 * // Configure state-dependent timeouts
 * static const rx_iwdt_config_t s_iwdt_config = {
 *   .default_timeout_ms = k_iwdt_hw_timeout_ms,
 *   .state_timeouts_ms = {
 *     [k_system_state_init]         = k_iwdt_timeout_init_ms,         // 5s
 *     [k_system_state_idle]         = k_iwdt_timeout_idle_ms,         // 5s
 *     [k_system_state_running]      = k_iwdt_timeout_running_ms,      // 2s
 *     [k_system_state_motor_active] = k_iwdt_timeout_motor_active_ms, // 2s
 *     [k_system_state_comm_active]  = k_iwdt_timeout_comm_active_ms,  // 2s
 *     [k_system_state_error]        = k_iwdt_timeout_error_ms,        // 10s
 *   }
 * };
 * @endcode
 *
 * @note All timeouts are in milliseconds (ms)
 * @note State timeouts must be less than hardware IWDT timeout (2048ms for running states)
 * @see system_state_t System state enumeration
 * @see rx_iwdt_config_t.state_timeouts_ms Array indexed by system_state_t
 * @see rx_iwdt_set_state() Function to transition between states
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_iwdt_timeout_init_ms =
    5000, /**< Init state timeout (5000ms). Allows slow startup: clock init, peripheral init, task creation. Exceeds hardware timeout (watchdog not yet started). Valid range: 2000-10000ms. */
  k_iwdt_timeout_idle_ms =
    5000, /**< Idle state timeout (5000ms). System initialized but no critical operations running. Same as init for consistency. Valid range: 2000-10000ms. */
  k_iwdt_timeout_running_ms =
    2000, /**< Running state timeout (2000ms). Default operational state. Matches hardware IWDT timeout. Must be fed at 100 Hz (10ms) to prevent reset. Valid range: 1000-2000ms. */
  k_iwdt_timeout_motor_active_ms =
    2000, /**< Motor active state timeout (2000ms). Motors running with closed-loop control at 100 Hz. Same as running state (motor control is time-critical). Valid range: 1000-2000ms. */
  k_iwdt_timeout_comm_active_ms =
    2000, /**< Communication active state timeout (2000ms). SPI communication in progress. Same as running (comm task runs at 100 Hz). Valid range: 1000-2000ms. */
  k_iwdt_timeout_error_ms =
    10000, /**< Error state timeout (10000ms). Extended timeout for error logging, diagnostics, and recovery attempts before reset. Allows thorough post-mortem. Valid range: 5000-16000ms. */
} iwdt_state_timeout_ms_t;

/**
 * @enum iwdt_task_timeout_ms_t
 * @brief IWDT per-task heartbeat timeout constants
 *
 * @details
 * Defines individual watchdog timeout periods for each ThreadX task. Each task
 * must call `rx_iwdt_task_heartbeat()` within its timeout period or the watchdog
 * monitor will detect the failure and stop feeding the hardware IWDT, triggering
 * a system reset after 2 seconds.
 *
 * **Timeout Calculation Strategy:**
 * Task timeout = 3x task period (allows 2 missed heartbeats before failure detection)
 *
 * **Timeout Categories:**
 * - **Fast tasks (10ms period)**: 30ms timeout - Motor control, communication, watchdog
 * - **Medium tasks (50ms period)**: 150ms timeout - Telemetry, LED status
 * - **Slow tasks (1000ms period)**: 3000ms timeout - temperature sensor
 * - **Variable tasks**: Custom timeout based on worst-case execution time
 *
 * **Failure Detection Flow:**
 * 1. Task misses heartbeat deadline
 * 2. Watchdog monitor detects timeout via `rx_iwdt_check_tasks()`
 * 3. Watchdog monitor stops feeding hardware IWDT
 * 4. Hardware IWDT triggers reset after 2048ms
 * 5. System reboots, failed task name preserved in logs
 *
 * @invariant All values in milliseconds. Task timeouts < state timeouts < hardware IWDT timeout.
 *            Heartbeat intervals must be < task timeouts (typically timeout/3 for 2 missed beats margin).
 *            Valid ranges: fast tasks (20-50ms), medium tasks (100-300ms), slow tasks (2000-5000ms).
 *
 * @code
 * // Register tasks with individual timeouts
 * rx_err_t err;
 * err = rx_iwdt_register_task("MotorCtrl", k_iwdt_task_timeout_motorctrl_ms);  // 30ms
 * err = rx_iwdt_register_task("CommTask", k_iwdt_task_timeout_commtask_ms);    // 30ms
 * err = rx_iwdt_register_task("Telemetry", k_iwdt_task_timeout_telemetry_ms);  // 150ms
 * @endcode
 *
 * @note All timeouts are in milliseconds (ms)
 * @note Task timeouts must be less than state timeout to allow proper detection
 * @note Heartbeat interval must be less than timeout (typically timeout/3)
 * @see rx_iwdt_register_task() Register task with timeout
 * @see rx_iwdt_task_heartbeat() Report task liveness
 * @see watchdog_monitor_task.c Monitors all task heartbeats at 100 Hz
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_iwdt_task_timeout_telemetry_ms =
    150, /**< Telemetry task timeout (150ms). Task period: 50ms @ 20 Hz. Timeout = 3x period. Heartbeat called every 50ms. Valid range: 100-300ms. If exceeded: telemetry stops, system reset after 2s. */
  k_iwdt_task_timeout_ledstatus_ms =
    150, /**< LED Status task timeout (150ms). Task period: 50ms @ 20 Hz. Timeout = 3x period. Heartbeat called every 50ms. Valid range: 100-300ms. If exceeded: LED updates stop, system reset after 2s. */
  k_iwdt_task_timeout_tempsensor_ms =
    3000, /**< Temperature Sensor task timeout (3000ms). Task period: 1000ms @ 1 Hz. Timeout = 3x period. Heartbeat called every 1s. Valid range: 2000-5000ms. If exceeded: temp compensation stops, system reset after 2s. */
  k_iwdt_task_timeout_obstdetect_ms =
    128, /**< Obstacle Detection task timeout (128ms, clamped to k_iwdt_min_timeout_ms).  Task heartbeat: 20ms @ 50 Hz.  ~6x headroom before hang detection fires. If exceeded: collision avoidance stops, system reset after 2s. */
  k_iwdt_task_timeout_motorctrl_ms =
    128, /**< Motor Control task timeout (128ms, clamped to k_iwdt_min_timeout_ms).  Task period: 10ms @ 100 Hz.  ~12x headroom before hang detection. If exceeded: motor control stops, system reset after 2s. CRITICAL TASK. */
  k_iwdt_task_timeout_commtask_ms =
    128, /**< Communication task timeout (128ms, clamped to k_iwdt_min_timeout_ms).  Task period: 10ms @ 100 Hz.  ~12x headroom before hang detection. If exceeded: SPI comm stops, system reset after 2s. CRITICAL TASK. */
  k_iwdt_task_timeout_watchdog_ms =
    128, /**< Watchdog Monitor task timeout (128ms, clamped to k_iwdt_min_timeout_ms).  Task period: 10ms @ 100 Hz.  Self-monitoring via own heartbeat. If exceeded: watchdog stops feeding IWDT, system reset after 2s. CRITICAL TASK. */
  k_iwdt_task_timeout_imu_ms =
    900, /**< IMU Task IWDT registration timeout (900ms). Intentionally exceeds k_imu_task_period_margin_ms (150ms): BNO055 POR alone takes ~700ms, so the IWDT window must span the full cold-start duration plus margin. Heartbeat is sent before each retry, so the gap between heartbeats is bounded by one retry attempt. */
} iwdt_task_timeout_ms_t;

/**
 * @var s_iwdt_config
 * @brief IWDT configuration for system watchdog monitoring
 *
 * @details
 * Configures Independent Watchdog Timer with:
 * - Hardware timeout: 2048ms (triggers reset if not fed)
 * - Task monitoring: Enabled (tracks heartbeats)
 * - Reset on timeout: Enabled (automatic system reset)
 * - State-dependent timeouts: 2s default, 5s init/idle, 10s error
 *
 * **Hardware watchdog**: 2048ms (CKS=10, ~2 seconds)
 * - Fed by watchdog monitor task @ 100 Hz (10ms period)
 * - Safety margin: 2048ms / 10ms = 204x (allows ~204 missed iterations)
 *
 * **Task monitoring**: Individual task timeouts
 * - Motor/Comm/Watchdog: 30ms (3x 10ms period)
 * - Obstacle: 60ms (3x 20ms period)
 * - LED/Telemetry: 150ms (3x 50ms period)
 * - Temp: 3000ms (3x 1000ms period)
 *
 * @warning Configuration is immutable after rx_iwdt_init()
 *
 * @note Configuration is immutable after rx_iwdt_init()
 * @see rx_iwdt_init() Initialization function using this config
 * @see system_state_t State definitions for state_timeouts_ms array
 *
 * @since Version 1.0.0
 */
static const rx_iwdt_config_t s_iwdt_config = {
  .default_timeout_ms     = k_iwdt_hw_timeout_ms, /**< 2048ms hardware timeout (CKS=10) */
  .enable_task_monitoring = true,                 /**< Enable task heartbeat tracking */
  .reset_on_timeout       = true,                 /**< Reset on timeout (not NMI) */
  .state_timeouts_ms      = {
    [k_system_state_init]         = k_iwdt_timeout_init_ms,    /**< 5s - slow startup */
    [k_system_state_idle]         = k_iwdt_timeout_idle_ms,    /**< 5s - no critical ops */
    [k_system_state_running]      = k_iwdt_timeout_running_ms, /**< 2s - default operation */
    [k_system_state_motor_active] = k_iwdt_timeout_motor_active_ms, /**< 2s - motor control */
    [k_system_state_comm_active]  = k_iwdt_timeout_comm_active_ms,  /**< 2s - communication */
    [k_system_state_error]        = k_iwdt_timeout_error_ms,        /**< 10s - recovery/diag */
  }};

