Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/* =============================================================================
 * tx_application_define Helper Functions
 *
 * These static helpers decompose the ThreadX application callback into
 * single-responsibility units that each stay under ~60 lines
 * (NASA Power of 10 Rule 4).
 * =============================================================================
 */

/**
 * @brief Initialize the global bus manager with infrastructure interfaces
 *
 * @details
 * Creates the bus manager singleton that all tasks use to access hardware buses.
 * The bus manager requires a ThreadX mutex internally, so it must be initialized
 * inside tx_application_define (after the ThreadX kernel is ready but before
 * the scheduler starts).
 *
 * @pre rx_infrastructure_init() completed successfully in main()
 * @pre ThreadX kernel initialized (mutex creation available)
 *
 * @post g_bus_manager initialized and ready for rx_bus_manager_add_bus() calls
 * @post Infrastructure error and pin interfaces wired into the bus manager
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_bus_manager_init() Underlying initialization function
 * @see internal_register_system_buses() Registers individual buses after this call
 *
 * @since Version 1.0.0
 */
static void internal_init_bus_manager(void)
{
  rx_error_interface_t* error_iface = rx_infrastructure_get_error_interface();
  rx_pin_interface_t*   pin_iface   = rx_infrastructure_get_pin_interface();

  rx_err_t err = rx_bus_manager_init(&g_bus_manager, "BUS_MGR", error_iface, pin_iface);
  RX_ASSERT(err == k_rx_ok, "rx_bus_manager_init must succeed");
}

/**
 * @brief Register all hardware buses (1-Wire, GPIO, ADC) with the bus manager
 *
 * @details
 * Initializes static bus configuration structs and registers them with the
 * global bus manager. Each bus is available to tasks via rx_bus_manager_get_interface().
 *
 * Registered buses:
 * - **onewire0** (P51): DS18B20 temperature sensor, 1-Wire bit-banging
 * - **gpio** (P00): Generic GPIO for motor driver control signals
 * - **motor0_current** (S12AD0, ch7, AN007, P47): Motor 0 (FL) IPROPI current sense
 * - **motor1_current** (S12AD0, ch6, AN006, P46): Motor 1 (FR) IPROPI current sense
 * - **motor2_current** (S12AD0, ch5, AN005, P45): Motor 2 (BL) IPROPI current sense
 * - **motor3_current** (S12AD0, ch4, AN004, P44): Motor 3 (BR) IPROPI current sense
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre Static bus config structs zeroed (BSS): s_onewire0_config, s_gpio_config,
 *      s_motor_current_configs[]
 *
 * @post All three buses registered and accessible via bus manager
 * @post Static config structs populated with bus parameters
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see internal_init_bus_manager() Must be called first
 * @see rx_bus_config_init_onewire() 1-Wire bus configuration
 * @see rx_bus_config_init_gpio() GPIO bus configuration
 * @see rx_bus_config_init_adc() ADC bus configuration
 *
 * @since Version 1.0.0
 */
/**
 * @brief Register the 1-Wire bus for the DS18B20 temperature sensor on P51
 *
 * @details
 * Initializes s_onewire0_config via rx_bus_config_init_onewire() and registers
 * it with the global bus manager. Failure asserts (boot precondition).
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre s_onewire0_config zero-initialized (BSS)
 *
 * @post s_onewire0_config populated with name="onewire0" and pin=P51
 * @post Bus "onewire0" available via the global bus manager
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see rx_bus_config_init_onewire() Underlying configuration helper
 * @see rx_bus_manager_add_bus() Registers the populated config
 *
 * @since Version 1.0.0
 */
static void internal_register_onewire0_bus(void)
{
  rx_err_t err = rx_bus_config_init_onewire(&s_onewire0_config,
                                            "onewire0", /* name */
                                            k_rx_p5_1); /* pin = P51 */
  RX_ASSERT(err == k_rx_ok, "onewire0 config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_onewire0_config);
  RX_ASSERT(err == k_rx_ok, "onewire0 registration must succeed");
}

/**
 * @brief Register the generic GPIO bus abstraction used by motor drivers
 *
 * @details
 * Initializes s_gpio_config via rx_bus_config_init_gpio() with placeholder pin
 * P00 (the API requires an initial pin -- actual pins are specified per-call by
 * motor_control_task) and registers it with the global bus manager.
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre s_gpio_config zero-initialized (BSS)
 *
 * @post s_gpio_config populated with name="gpio" and initial pin=P00
 * @post Bus "gpio" available via the global bus manager
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see rx_bus_config_init_gpio() Underlying configuration helper
 * @see rx_bus_manager_add_bus() Registers the populated config
 *
 * @since Version 1.0.0
 */
static void internal_register_gpio_bus(void)
{
  rx_err_t err = rx_bus_config_init_gpio(&s_gpio_config,
                                         "gpio",     /* name */
                                         k_rx_p0_0); /* pin = P00 (generic bus) */
  RX_ASSERT(err == k_rx_ok, "gpio config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_gpio_config);
  RX_ASSERT(err == k_rx_ok, "gpio registration must succeed");
}

/**
 * @brief Register all four motor current-sense ADC channels (S12AD0)
 *
 * @details
 * Iterates over k_motor_current_adc_channels[] and registers one ADC bus per
 * motor (FL, FR, BL, BR) on S12AD0 channels 4-7. Each iteration:
 *   1. Populates s_motor_current_configs[i] via rx_bus_config_init_adc()
 *   2. Adds the config to the bus manager
 *   3. Initialises the ADC hardware via rx_bus_adc_init()
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre s_motor_current_configs[] zero-initialized (BSS)
 * @pre k_motor_current_adc_channels and g_motor_current_bus_names indexed [0..k_motor_current_adc_count)
 *
 * @post All four motor-current ADC buses registered and ADC hardware initialised
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see rx_bus_config_init_adc() Underlying configuration helper
 * @see rx_bus_adc_init() Initialises ADC hardware after registration
 *
 * @since Version 1.0.0
 */
static void internal_register_motor_current_adc_buses(void)
{
  for (uint8_t i = 0; i < k_motor_current_adc_count; i++) {
    rx_err_t err = rx_bus_config_init_adc(&s_motor_current_configs[i],
                                          g_motor_current_bus_names[i],    /* name (shared) */
                                          k_adc_unit_0,                    /* unit = S12AD0 */
                                          k_motor_current_adc_channels[i], /* channel = AN004-7 */
                                          k_adc_resolution_12bit);         /* bits = 12-bit */
    RX_ASSERT(err == k_rx_ok, "motor_current config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_motor_current_configs[i]);
    RX_ASSERT(err == k_rx_ok, "motor_current registration must succeed");
    err = rx_bus_adc_init(&g_bus_manager, g_motor_current_bus_names[i]);
    RX_ASSERT(err == k_rx_ok, "motor_current ADC init must succeed");
  }
}

/**
 * @brief Register a single mandatory I2C device on RIIC1 at 400 kHz
 *
 * @details
 * Common wrapper for the BNO055 and BMP280 registrations: both share RIIC1,
 * SDA=P2.0, SCL=P2.1, and 400 kHz fast mode and differ only by name, device
 * address and config-storage struct. Failure asserts (boot precondition).
 *
 * Steps:
 *   1. rx_bus_config_init_i2c(config, name, RIIC1, addr, P2.0, P2.1, 400 kHz)
 *   2. rx_bus_manager_add_bus(g_bus_manager, config)
 *   3. rx_bus_i2c_init(g_bus_manager, name)
 *
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre config != NULL and points to BSS-zeroed storage
 * @pre name is a stable string with lifetime >= bus manager lifetime
 *
 * @post Bus "name" registered, configured and ready for read/write
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see rx_bus_config_init_i2c() Underlying configuration helper
 * @see rx_bus_i2c_init() Initialises RIIC hardware after registration
 *
 * @since Version 1.0.0
 */
static void
internal_register_riic1_device(rx_bus_config_t* config, const char* name, uint8_t device_addr)
{
  rx_err_t err = rx_bus_config_init_i2c(config,
                                        name,
                                        k_riic_channel_1,        /* channel: RIIC1 */
                                        device_addr,             /* device_addr: per-sensor */
                                        k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                                        k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                                        k_i2c_frequency_400khz); /* 400 kHz fast mode */
  RX_ASSERT(err == k_rx_ok, "RIIC1 device config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, config);
  RX_ASSERT(err == k_rx_ok, "RIIC1 device registration must succeed");
  err = rx_bus_i2c_init(&g_bus_manager, name);
  RX_ASSERT(err == k_rx_ok, "RIIC1 device I2C init must succeed");
}

/**
 * @brief Probe MPU-6050 WHO_AM_I and persist {who_am_i, err} to data flash
 *
 * @details
 * Bench-only diagnostic: registers the GY-521/MPU-6050 at 0x68 on RIIC1, reads
 * register 0x75 (WHO_AM_I), and writes the result to data flash at 0x00100000
 * via internal_bench_dflash_write() so the result is recoverable through
 * rfp-cli without a UART bridge.
 *
 * Unlike the BNO055/BMP280 paths, missing hardware here is **not fatal** -- the
 * function logs the failure and continues. RX_ASSERT is intentionally absent.
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre s_i2c1_mpu_config zero-initialized (BSS)
 *
 * @post s_i2c1_mpu_config populated with bench bus parameters (best-effort)
 * @post Data flash @ 0x00100000 contains {magic, who_am_i, err} record
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see internal_bench_dflash_write() Persists the probe result
 * @see rx_bus_i2c_write_read() Performs the WHO_AM_I single-byte read
 *
 * @since Version 1.0.0
 */
static void internal_probe_mpu6050_who_am_i(void)
{
  rx_err_t err = rx_bus_config_init_i2c(&s_i2c1_mpu_config,
                                        "i2c1_mpu",              /* bench-test bus name */
                                        k_riic_channel_1,        /* channel: RIIC1 */
                                        k_i2c_addr_mpu6050,      /* device_addr: 0x68 */
                                        k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                                        k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                                        k_i2c_frequency_400khz); /* frequency_hz: 400 kHz */
  if (err == k_rx_ok) {
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c1_mpu_config);
  }
  if (err == k_rx_ok) {
    err = rx_bus_i2c_init(&g_bus_manager, "i2c1_mpu");
  }
  uint8_t who_am_i  = 0x00U;
  int32_t probe_err = err; /* preserve setup err if any */
  if (err == k_rx_ok) {
    const uint8_t who_am_i_reg = 0x75U; /* MPU-6050 WHO_AM_I register */
    err       = rx_bus_i2c_write_read(&g_bus_manager, "i2c1_mpu", &who_am_i_reg, 1U, &who_am_i, 1U);
    probe_err = err;
    if (err == k_rx_ok) {
      rx_log_info_val(s_mpu6050_tag, "WHO_AM_I=0x", who_am_i);
    } else {
      rx_log_error_val(s_mpu6050_tag, "WHO_AM_I read failed err=", (uint32_t)err);
    }
  } else {
    rx_log_error_val(s_mpu6050_tag, "bus setup failed err=", (uint32_t)err);
  }

