Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* Persist the result to data flash @ 0x00100000 so it's readable via
   * rfp-cli -rv 0x00100000 16 without needing the UART bridge. */
  internal_bench_dflash_write(who_am_i, probe_err);
}

static void internal_register_system_buses(void)
{
  /* Production buses required by tasks. */
  internal_register_onewire0_bus();
  internal_register_gpio_bus();
  internal_register_motor_current_adc_buses();
  internal_register_riic1_device(&s_i2c1_imu_config, "i2c1_imu", k_i2c_addr_bno055);
  internal_register_riic1_device(&s_i2c1_baro_config, "i2c1_baro", k_i2c_addr_bmp280);

  /* Bench-only diagnostic; not fatal if the module is absent. */
  internal_probe_mpu6050_who_am_i();
}

/**
 * @brief Initialize shared data module and hardware watchdog timer
 *
 * @details
 * Sets up inter-task communication (ThreadX mutexes and event flags via shared_data_init)
 * and initializes the Independent Watchdog Timer with state-dependent timeouts.
 *
 * @pre internal_register_system_buses() completed (buses available for tasks)
 * @pre ThreadX kernel initialized (mutex/event-flag creation available)
 *
 * @post Shared data mutexes and event flags created and ready for task use
 * @post IWDT hardware configured with s_iwdt_config parameters
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see shared_data_init() Inter-task communication setup
 * @see rx_iwdt_init() Hardware watchdog initialization
 *
 * @since Version 1.0.0
 */
static void internal_init_shared_data_and_watchdog(void)
{
  /* Initialize shared data module (mutexes, event flags) */
  rx_err_t err = shared_data_init();
  RX_ASSERT(err == k_rx_ok, "shared_data_init must succeed");

  /* Initialize IWDT (hardware watchdog + task monitoring) */
  err = rx_iwdt_init(&s_iwdt_config);
  RX_ASSERT(err == k_rx_ok, "rx_iwdt_init must succeed");
}

/**
 * @brief Register all eight tasks for IWDT heartbeat monitoring and set initial state
 *
 * @details
 * Registers each application task with the IWDT module so that missed heartbeats
 * are detected. Timeouts are set to 3x the nominal task period to allow two
 * missed heartbeats before a timeout is declared.
 *
 * Task timeout mapping:
 * - Telemetry (50ms period) -> 150ms timeout
 * - LED Status (50ms period) -> 150ms timeout
 * - Temp Sensor (1000ms period) -> 3000ms timeout
 * - Obstacle Detect (20ms period) -> 60ms timeout
 * - Motor Control (10ms period) -> 30ms timeout
 * - Communication (10ms period) -> 30ms timeout
 * - Watchdog Monitor (10ms period) -> 30ms timeout
 *
 * After all tasks are registered the system state is set to k_system_state_init
 * so the IWDT uses the 5-second init-phase timeout.
 *
 * @pre internal_init_shared_data_and_watchdog() completed (IWDT initialized)
 * @pre No tasks registered yet (first call after rx_iwdt_init)
 *
 * @post All eight tasks registered with per-task heartbeat timeouts
 * @post IWDT system state set to k_system_state_init (5s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_iwdt_register_task() Registers a single task for monitoring
 * @see rx_iwdt_set_state() Sets system state for state-dependent timeouts
 *
 * @since Version 1.0.0
 */
static void internal_register_iwdt_tasks(void)
{
  /* MVP BYPASS (2026-04-22): telemetry_task is dormant (replaced by
   * serial_bringup_task ASCII telemetry). Registering its slot without
   * its heartbeater would cause watchdog_monitor_task to stop feeding
   * the hardware IWDT, triggering a 2 s reset loop that also drops the
   * Cypress USB-UART because /RES# is shared (verified via PCB
   * netlist: U4-pin1 and U11-pin1 on same net 74). */
  // rx_err_t err = rx_iwdt_register_task("Telemetry", k_iwdt_task_timeout_telemetry_ms);
  // RX_ASSERT(err == k_rx_ok, "Telemetry IWDT registration must succeed");

  rx_err_t err = rx_iwdt_register_task("LEDStatus", k_iwdt_task_timeout_ledstatus_ms);
  RX_ASSERT(err == k_rx_ok, "LEDStatus IWDT registration must succeed");

  /* TempSensor / ObstDetect / ImuTask / MotorCtrl IWDT registrations
   * are disabled in lockstep with their task_create calls below.  If
   * we register them here but the task is never created to send
   * heartbeats, IWDT fires a reset ~5 s after k_system_state_running
   * transitions, and the board loops so fast through boot that only
   * main.c's final D13 LED marker is visible.  Re-enable each line
   * ONCE its matching task_create is re-enabled (see comment block
   * inside internal_create_system_tasks).
   */

  // err = rx_iwdt_register_task("TempSensor", k_iwdt_task_timeout_tempsensor_ms);
  // RX_ASSERT(err == k_rx_ok, "TempSensor IWDT registration must succeed");

  // err = rx_iwdt_register_task("ObstDetect", k_iwdt_task_timeout_obstdetect_ms);
  // RX_ASSERT(err == k_rx_ok, "ObstDetect IWDT registration must succeed");

  // err = rx_iwdt_register_task("MotorCtrl", k_iwdt_task_timeout_motorctrl_ms);
  // RX_ASSERT(err == k_rx_ok, "MotorCtrl IWDT registration must succeed");

  /* MVP BYPASS (2026-04-22): CommTask was replaced by serial_bringup_task
   * for SLAM bring-up. Registering CommTask here while its creator is
   * commented out causes IWDT to fire after 2 s -- resetting the RX72N,
   * which drops the Cypress USB-UART (04b4:0003) off USB and makes
   * /dev/ttyACM0 vanish every ~2 s. Re-enable with comm_task_create(). */
  // err = rx_iwdt_register_task("CommTask", k_iwdt_task_timeout_commtask_ms);
  // RX_ASSERT(err == k_rx_ok, "CommTask IWDT registration must succeed");

  err = rx_iwdt_register_task("SerialBU", k_iwdt_task_timeout_commtask_ms);
  RX_ASSERT(err == k_rx_ok, "SerialBU IWDT registration must succeed");

  err = rx_iwdt_register_task("WatchdogMon", k_iwdt_task_timeout_watchdog_ms);
  RX_ASSERT(err == k_rx_ok, "WatchdogMon IWDT registration must succeed");

  err = rx_iwdt_register_task("ImuTask", k_iwdt_task_timeout_imu_ms);
  RX_ASSERT(err == k_rx_ok, "ImuTask IWDT registration must succeed");

  /* Set initial IWDT state (init phase - 5s timeout) */
  err = rx_iwdt_set_state(k_system_state_init);
  RX_ASSERT(err == k_rx_ok, "IWDT set init state must succeed");
}

/**
 * @brief Create all eight application tasks and transition to running state
 *
 * @details
 * Creates all eight ThreadX tasks in dependency-aware order (lowest priority
 * first, except Watchdog Monitor which follows Communication for logical
 * grouping). Tasks do not begin executing until tx_application_define()
 * returns and the scheduler starts. After all tasks are created, the IWDT
 * system state transitions to k_system_state_running.
 *
 * Task creation order:
 * 1. Telemetry (priority 18, lowest)
 * 2. LED Status (priority 17)
 * 3. Temperature Sensor (priority 15)
 * 4. IMU (priority 13, BNO055 + BMP280)
 * 5. Obstacle Detection (priority 12)
 * 6. Motor Control (priority 8)
 * 7. Communication (priority 5)
 * 8. Watchdog Monitor (priority 6)
 *
 * @pre internal_register_iwdt_tasks() completed (all tasks registered for monitoring)
 * @pre Static task stacks allocated in each task module
 *
 * @post All eight ThreadX threads created in READY state
 * @post IWDT system state set to k_system_state_running (2s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 * @note Tasks do not begin executing until tx_application_define() returns.
 *
 * @see telemetry_task_create() through watchdog_monitor_task_create()
 * @see rx_iwdt_set_state() Transitions to running state after task creation
 *
 * @since Version 1.0.0
 */
/**
 * @brief Create the low-priority observability tasks (serial bring-up + LED status)
 *
 * @details
 * Spawns the lowest-priority threads first so the scheduler has visible
 * heartbeat output the moment higher-priority work begins:
 * - serial_bringup_task (priority 18 slot, replaces the dormant telemetry_task)
 * - led_status_task (priority 17, blinks D9 at 1 Hz once running)
 *
 * MVP BYPASS (2026-04-22): the framed nanopb / HARQ / session stack is
 * currently disabled; serial_bringup_task owns SCI9 with a simple ASCII line
 * protocol for SLAM bring-up. To restore framed comms, swap
 * serial_bringup_task_create() for telemetry_task_create() + comm_task_create()
 * and update the matching IWDT registrations in internal_register_iwdt_tasks().
 *
 * @pre internal_register_iwdt_tasks() completed (heartbeat slots reserved)
 * @pre Per-task static stacks defined in their respective task modules
 *
 * @post serial_bringup_task and led_status_task created in READY state
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see serial_bringup_task_create() Replaces telemetry_task in the MVP
 * @see led_status_task_create() D9 heartbeat
 *
 * @since Version 1.0.0
 */
static void internal_create_observability_tasks(void)
{
  /* Telemetry Task - Priority 18 (lowest) */
  // rx_err_t err = telemetry_task_create();
  // RX_ASSERT(err == k_rx_ok, "telemetry_task_create must succeed");
  rx_err_t err = serial_bringup_task_create();
  RX_ASSERT(err == k_rx_ok, "serial_bringup_task_create must succeed");

