Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* LED Status Task - Priority 17 (visual feedback) */
  err = led_status_task_create();
  RX_ASSERT(err == k_rx_ok, "led_status_task_create must succeed");
}

/**
 * @brief Create the sensor and motor-control tasks (IMU + motor control)
 *
 * @details
 * Spawns the safety-critical mid-priority tasks. Exact set is gated by the
 * scheduler-bring-up TODO (2026-04-22): temp_sensor_task / obstacle_detect_task
 * / comm_task are currently commented out because each hangs its own init path
 * when the scheduler is alive, starving the lower-priority observability tasks.
 * Re-enable lines ONE AT A TIME after each task's init hang is diagnosed.
 *
 * Currently active:
 * - imu_task (priority 13, BNO055 + BMP280 at 20 Hz)
 * - motor_control_task (priority 8, 250 Hz control loop)
 *
 * @pre internal_create_observability_tasks() completed
 * @pre internal_register_system_buses() registered i2c1_imu, i2c1_baro and gpio buses
 *
 * @post imu_task and motor_control_task created in READY state
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see imu_task_create() BNO055/BMP280 fusion task
 * @see motor_control_task_create() 250 Hz PID + telemetry task
 *
 * @since Version 1.0.0
 */
static void internal_create_sensor_and_motor_tasks(void)
{
  /* TODO(2026-04-22, scheduler-bring-up): temp / imu / obstacle / motor
   * tasks are DISABLED here because each hangs its own init path when the
   * scheduler is alive, starving every lower-priority task (led_status
   * and telemetry both sit below these four in priority).  The scheduler
   * itself is now verified working end-to-end -- D9 heartbeat blinks at
   * 1 Hz in this build once these four are commented out.  Re-enable
   * each ONE AT A TIME after its specific init hang is diagnosed and
   * fixed; they are orthogonal problems from the scheduler fix chain
   * committed with this change.
   *
   *   temp_sensor_task   : 1-Wire / DS18B20 bring-up (pri 15)
   *   imu_task           : BNO055 / BMP280 on RIIC1 (pri 13)
   *   obstacle_detect_task: HC-SR04 hardware bring-up blocked per
   *                        project_sonar_bringup_blocked.md (pri 12)
   *   motor_control_task : internal_init_motor_stack() hangs on real
   *                        hardware (pri 8)
   */

  /* Temperature Sensor Task - Priority 15 */
  // rx_err_t err = temp_sensor_task_create();
  // RX_ASSERT(err == k_rx_ok, "temp_sensor_task_create must succeed");

  /* IMU Task - Priority 13 (BNO055 + BMP280 at 20 Hz) */
  rx_err_t err = imu_task_create();
  RX_ASSERT(err == k_rx_ok, "imu_task_create must succeed");

  /* Obstacle Detection Task - Priority 12 */
  // err = obstacle_detect_task_create();
  // RX_ASSERT(err == k_rx_ok, "obstacle_detect_task_create must succeed");

  /* Communication Task - Priority 5 (highest)
   * MVP BYPASS (2026-04-22): disabled -- serial_bringup_task owns SCI9.
   * See the comment block above telemetry_task_create() for details. */
  // err = comm_task_create();
  // RX_ASSERT(err == k_rx_ok, "comm_task_create must succeed");

  /* Motor Control Task - Priority 8 */
  err = motor_control_task_create();
  RX_ASSERT(err == k_rx_ok, "motor_control_task_create must succeed");
}

/**
 * @brief Create the infrastructure tasks (USB CDC stack + watchdog monitor)
 *
 * @details
 * Spawns the highest-priority infrastructure tasks last so that they pre-empt
 * the lower priority work as soon as the scheduler starts:
 * - usb_task (priority 4, drives 3-port CDC: ttyACM0 PROTO, 1 DECODED, 2 LOG)
 * - watchdog_monitor_task (priority 6, IWDT feeding + heartbeat aggregation)
 *
 * The 9 non-control USB pipes split 3 per CDC; HUM Ch.40 allows 10 pipes total
 * (DCP + 9), so all three CDCs fit cleanly. usb_task also polls the production
 * rx_usb_isr_handler() once per tick as a backstop in case the SLIBR/IER edge
 * case ever drops a USBI0.
 *
 * @pre internal_create_sensor_and_motor_tasks() completed
 * @pre rx_usb_init() completed in main() pre-kernel window
 *
 * @post usb_task and watchdog_monitor_task created in READY state
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see usb_task_create() 3-port CDC stack driver
 * @see watchdog_monitor_task_create() IWDT feeding + heartbeat aggregation
 *
 * @since Version 1.0.0
 */
static void internal_create_infrastructure_tasks(void)
{
  /* USB Task - Priority 4 (above comm_task) -- drives the 3-port CDC
   * stack: ttyACM0 PROTO (R/W), ttyACM1 DECODED (R/W), ttyACM2 LOG (RO).
   * The 9 non-control USB pipes split 3 per CDC; HUM Ch.40 allows 10
   * pipes total (DCP + 9), so all three CDCs fit cleanly.  Polls the
   * production rx_usb_isr_handler() once per tick as a backstop in
   * case the SLIBR/IER edge case ever drops a USBI0. */
  rx_err_t err = usb_task_create();
  RX_ASSERT(err == k_rx_ok, "usb_task_create must succeed");

  /* Watchdog Monitor Task - Priority 6 */
  err = watchdog_monitor_task_create();
  RX_ASSERT(err == k_rx_ok, "watchdog_monitor_task_create must succeed");
}

/**
 * @brief Transition the IWDT state machine to k_system_state_running
 *
 * @details
 * After all application tasks are created, switch the IWDT to the 2-second
 * running-state timeout. Until this point the IWDT used the 5-second
 * init-phase timeout configured by internal_register_iwdt_tasks().
 *
 * @pre internal_create_observability_tasks() completed
 * @pre internal_create_sensor_and_motor_tasks() completed
 * @pre internal_create_infrastructure_tasks() completed
 *
 * @post IWDT state == k_system_state_running (2 s timeout)
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see rx_iwdt_set_state() State machine setter
 *
 * @since Version 1.0.0
 */
static void internal_set_iwdt_running_state(void)
{
  rx_err_t err = rx_iwdt_set_state(k_system_state_running);
  RX_ASSERT(err == k_rx_ok, "IWDT set running state must succeed");
}

static void internal_create_system_tasks(void)
{
  internal_create_observability_tasks();
  internal_create_sensor_and_motor_tasks();
  internal_create_infrastructure_tasks();
  internal_set_iwdt_running_state();
}

/**
 * @brief Register ThreadX stack overflow detection handler
 *
 * @details
 * Installs the rx_stack_monitor callback that ThreadX invokes when any thread
 * exceeds its allocated stack. Requires TX_ENABLE_STACK_CHECKING to be defined
 * in the ThreadX build configuration.
 *
 * @pre All application tasks created via internal_create_system_tasks()
 * @pre ThreadX TX_ENABLE_STACK_CHECKING enabled at build time
 *
 * @post Stack overflow handler registered with ThreadX kernel
 * @post Any future stack overflow triggers rx_stack_monitor callback
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_stack_monitor_init() Underlying registration function
 *
 * @since Version 1.0.0
 */
static void internal_init_stack_monitor(void)
{
  rx_err_t err = rx_stack_monitor_init();
  RX_ASSERT(err == k_rx_ok, "rx_stack_monitor_init must succeed");
}

/**
 * @brief ThreadX application definition callback - Create application threads and kernel objects
 *
 * @details
 * This function is **called by the ThreadX kernel** immediately after `tx_kernel_enter()`.
 * It provides the application with an entry point to create threads, semaphores, message queues,
 * mutexes, and other RTOS kernel objects.
 *
 * **ThreadX startup sequence:**
 * ```
 * main() -> tx_kernel_enter() -> [ThreadX internal init] -> tx_application_define() -> [scheduler start]
 * ```
 *
 * ## Application Thread Creation
 *
 * This callback delegates to six internal helpers that each handle a single
 * initialization responsibility (NASA Power of 10 Rule 4 compliance):
 *
 * 1. internal_init_bus_manager() - bus manager singleton
 * 2. internal_register_system_buses() - 1-Wire, GPIO, ADC bus configs
 * 3. internal_init_shared_data_and_watchdog() - shared data + IWDT hardware
 * 4. internal_register_iwdt_tasks() - per-task heartbeat registration
 * 5. internal_create_system_tasks() - ThreadX thread creation (7 tasks)
 * 6. internal_init_stack_monitor() - stack overflow detection
 *
 * ## Memory Management
 *
 * **first_unused_memory parameter:**
 * - Points to the first byte of unused SRAM after ThreadX kernel allocation
 * - Used for dynamically creating kernel objects (NOT used in STAR firmware)
 * - STAR uses **static allocation only** (stacks defined at compile-time)
 *
 * **Memory layout after ThreadX init:**
 * | Region | Size | Purpose |
 * |--------|------|---------|
 * | **BSS/Data** | ~10 KB | Global variables, ThreadX kernel data |
 * | **ThreadX heap** | 0 bytes | **Not used** (zero dynamic allocation policy) |
 * | **Task stacks (x7)** | varies | Static arrays in each task module (comm, watchdog, motor, etc.) |
 * | **first_unused_memory** | ~490 KB | Remaining free SRAM (unused) |
 *
 * ## Thread Creation Timing (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | tx_application_define() call | ~5 us | ThreadX callback overhead |
 * | Task creation (7 tasks) | ~140 us | TCB init, stack setup per task |
 * | **Total** | **~145 us** | Fast thread creation |
 *
 * ## Error Handling
 *
 * **Critical assertion:** Thread creation MUST succeed. Failure indicates:
 * - Memory exhaustion (insufficient SRAM for stack)
 * - Invalid thread parameters (priority, stack size)
 * - ThreadX internal error (corruption)
 *
 * **Recovery:** Assert-halt on failure (no recovery possible - critical error)
 *
 *
 *
 * @pre ThreadX kernel initialized (tx_kernel_enter() called from main())
 * @pre SRAM available for thread stacks
 * @pre first_unused_memory points to valid SRAM address
 *
 * @post All eight application tasks created and ready to run (scheduler starts after return)
 * @post Thread stacks allocated statically and initialized (SP set to stack top for each task)
 * @post Thread priorities configured for eight distinct tasks (comm_task holds priority 5)
 * @post IWDT task monitoring registered for all eight tasks with per-task timeouts
 * @post ThreadX stack overflow handler registered via rx_stack_monitor_init()
 *
 * @note **This function executes BEFORE the ThreadX scheduler starts.** Threads created here
 *       are in READY state but do not execute until this function returns.
 *
 * @note **No blocking calls allowed** in this function (no tx_thread_sleep, tx_semaphore_get, etc.)
 *       as the scheduler is not yet running.
 *
 * @warning **Never return error from this function.** ThreadX callback convention requires void return.
 *          Use RX_ASSERT to halt on critical failures instead.
 *
 * @par Thread Safety:
 * Executes in single-threaded context (scheduler not started yet). No synchronization needed.
 *
 * @par Example Usage (Internal ThreadX Call):
 * @code
 * // ThreadX kernel calls this after tx_kernel_enter():
 * void tx_kernel_enter(void) {
 *   // ... ThreadX internal initialization ...
 *
 *   // Call application-defined callback
 *   tx_application_define(first_unused_memory);
 *
 *   // Start scheduler (threads begin executing)
 *   _tx_thread_schedule();
 * }
 * @endcode
 *
 * @see internal_init_bus_manager() Step 1: Bus manager initialization
 * @see internal_register_system_buses() Step 2: Bus registration
 * @see internal_init_shared_data_and_watchdog() Step 3: Shared data and IWDT
 * @see internal_register_iwdt_tasks() Step 4: Task heartbeat registration
 * @see internal_create_system_tasks() Step 5: ThreadX thread creation
 * @see internal_init_stack_monitor() Step 6: Stack overflow detection
 * @see tx_kernel_enter() Start ThreadX scheduler (calls this callback internally)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify thread creation and scheduler startup
 */
void tx_application_define(void* first_unused_memory)
{
  /* Precondition: first_unused_memory parameter is provided by ThreadX */
  RX_ASSERT(first_unused_memory != nullptr, "Precondition: first_unused_memory must be valid");

  /* =========================================================================
   * Multi-Task Architecture Initialization
   *
   * Task creation order is dependency-aware while the scheduler is not yet
   * running; no task preemption occurs during this phase.
   *
   * Priority Map (lower = higher priority):
   *   5  = Communication (highest - command latency)
   *   6  = Watchdog Monitor (IWDT feeding + task heartbeat checks)
   *   8  = Motor Control (250 Hz control loop)
   *   12 = Obstacle Detection (safety-critical)
   *   13 = IMU (BNO055 + BMP280 at 20 Hz)
   *   15 = Temperature Sensing (1 Hz)
   *   17 = LED Status (20 Hz, visual feedback)
   *   18 = Telemetry Aggregation (20 Hz, lowest)
   * =========================================================================
   */

  /* Step 1: Initialize bus manager (requires ThreadX mutex) */
  internal_init_bus_manager();

  /* Step 2: Register buses with manager (before tasks need them) */
  internal_register_system_buses();

  /* Step 3: Initialize shared data and hardware watchdog */
  internal_init_shared_data_and_watchdog();

  /* Step 4: Register all tasks for IWDT heartbeat monitoring */
  internal_register_iwdt_tasks();

