Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  *prcr = k_main_prcr_unlock_clock_lpm;
  *mstpcrb &= ~(uint32_t)k_inline_bit_mstpb_usb0;
  *prcr = k_main_prcr_lock_all;

  /* HUM 40.3.1.1 ("Setting Data to the USB Related Register"):
   *   "Setting the SYSCFG.USBE bit to 1 AFTER starting the clock supply
   *    to the USB (SYSCFG.SCKE bit = 1) enables and starts USB operation."
   * The previous order (USBE then SCKE) silently no-ops half the SYSCFG
   * follow-on writes because the USB module clock is gated until SCKE=1
   * is acknowledged.  Required order: clear SYSCFG -> SCKE=1 -> wait ->
   * USBE=1.  DPRPU stays 0 here; it is asserted last (after pipe + ICU
   * config) to announce attach to the host. */
  *syscfg = k_inline_val_syscfg_clear;
  for (volatile uint32_t d = 0; d < k_usb_syscfg_settle_nops; d++) {
    __asm__ volatile("nop");
  }
  *syscfg |= (uint16_t)k_inline_bit_syscfg_scke; /* SCKE first per HUM 40.3.1.1 */
  for (volatile uint32_t d = 0; d < k_usb_syscfg_settle_nops; d++) {
    __asm__ volatile("nop");
  }
  *syscfg |= (uint16_t)k_inline_bit_syscfg_usbe; /* USBE only after the clock is up */

  /* RX72N PHY housekeeping that mirrors rx_usb_hw.c's
   * internal_usb_configure_phy() -- must run between USBE=1 and
   * INTENB0 programming.  See tinyusb renesas/usba dcd_usba.c:626-628.
   *   - USB.DPUSR0R.FIXPHY0 cleared: release PHY from output-fixed state
   *   - USB0.PHYSLEW = 0x5     : RX72N-specific slew-rate trim */
  volatile uint32_t* const dpusr0r = (volatile uint32_t*)k_inline_addr_dpusr0r;
  volatile uint32_t* const physlew = (volatile uint32_t*)k_inline_addr_physlew;
  *dpusr0r &= ~(uint32_t)k_inline_bit_dpusr0r_fixphy0;
  *physlew = (uint32_t)k_inline_val_physlew;
}

/**
 * @brief Configure USB0 default control pipe (DCP) and endpoint interrupt enables
 *
 * @details
 * Programs DCPCFG, DCPMAXP=64 (default control pipe), DCPCTR=0x01, then enables
 * BRDY/BEMP for pipe 0 (DCP) and the global INTENB0 mask covering VBSE, RESM,
 * SOFE, DVSE, CTRE. Finally asserts SYSCFG.DPRPU to pull D+ high and announce
 * attach to the host.
 *
 * @pre internal_inline_usb0_clock_and_phy() completed (USBE=1, PHY trimmed)
 *
 * @post DCP configured for 64-byte EP0 control transfers
 * @post BRDYENB / BEMPENB / INTENB0 enable masks programmed
 * @post DPRPU=1 (D+ pull-up engaged; host enumeration begins)
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see HUM 40 Default Control Pipe register layout
 *
 * @since Version 1.0.0
 */
static void internal_inline_usb0_endpoint_setup(void)
{
  volatile uint16_t* const syscfg  = (volatile uint16_t*)k_inline_addr_syscfg;
  volatile uint16_t* const intenb0 = (volatile uint16_t*)k_inline_addr_intenb0;
  volatile uint16_t* const brdyenb = (volatile uint16_t*)k_inline_addr_brdyenb;
  volatile uint16_t* const bempenb = (volatile uint16_t*)k_inline_addr_bempenb;
  volatile uint16_t* const dcpcfg  = (volatile uint16_t*)k_inline_addr_dcpcfg;
  volatile uint16_t* const dcpmaxp = (volatile uint16_t*)k_inline_addr_dcpmaxp;
  volatile uint16_t* const dcpctr  = (volatile uint16_t*)k_inline_addr_dcpctr;

  *dcpcfg  = (uint16_t)k_inline_val_dcpcfg;
  *dcpmaxp = (uint16_t)k_inline_val_dcpmaxp_64;
  *dcpctr  = (uint16_t)k_inline_val_dcpctr_pid_buf;
  *brdyenb = (uint16_t)k_inline_val_brdyenb_pipe0;
  *bempenb = (uint16_t)k_inline_val_bempenb_pipe0;
  *intenb0 = (uint16_t)((uint32_t)k_inline_bit_intenb0_vbse | (uint32_t)k_inline_bit_intenb0_rsme |
                        (uint32_t)k_inline_bit_intenb0_sofe | (uint32_t)k_inline_bit_intenb0_dvse |
                        (uint32_t)k_inline_bit_intenb0_ctre);

  *syscfg |= (uint16_t)k_inline_bit_syscfg_dprpu;
}

/**
 * @brief Wire USB0 USBI to ICU vector 144 (HUM 15.7.7 software-configurable IRQ)
 *
 * @details
 * USBI0 is a Group-B software-configurable interrupt on RX72N (HW manual Ch15
 * Table 15.3; hirakuni45/RX RX72N icu.hpp SELECTB::USBI0 = 62), so SLIBR[144]
 * must be programmed to 62 before IER/IPR/IR for vector 144 do anything.
 * Earlier revisions used vector 36 (a reserved gap), which silently consumed
 * IER/IPR writes and left the ISR dormant.
 *
 * Steps follow HUM 15.7.7 mandatory 9-step procedure:
 *   (1) IER bit clear (POR default; we re-set it in step 9)
 *   (2) SLIBR144 = 62 (USBI0 source code)
 *   (5) SLIPRCR.WPRC = 1   <-- previously missing -> ISR never fired
 *   (6) confirm WPRC == 1 (bounded poll, NASA P10 Rule 2)
 *   (8) IR144 = 0          (edge-detected vector, clear stale request)
 *   (9) IER18.IEN0 = 1     (enable vector 144 delivery)
 *
 * @pre internal_inline_usb0_endpoint_setup() completed (DPRPU on, EP enables set)
 *
 * @post SLIBR[144] = 62, SLIPRCR.WPRC latched (best-effort within bounded poll)
 * @post IPR[144] = 12, IR[144] = 0, IER18.IEN0 = 1
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 * @note If WPRC fails to latch within the bounded poll, the IER enable below is
 *       a no-op -- the ISR-entry counter diagnostic catches that case.
 *
 * @see HUM 15.7.7 Setting Software Configurable Interrupts (page 153)
 *
 * @since Version 1.0.0
 */
static void internal_inline_usb0_icu_setup(void)
{
  volatile uint8_t* const slibr144 =
    (volatile uint8_t*)(k_inline_addr_icu_slibr + (uintptr_t)k_inline_icu_usbi0_vector);
  volatile uint8_t* const sliprcr = (volatile uint8_t*)k_inline_addr_sliprcr;
  volatile uint8_t* const ipr144 =
    (volatile uint8_t*)(k_inline_addr_icu_ipr + (uintptr_t)k_inline_icu_usbi0_vector);
  volatile uint8_t* const ir144 =
    (volatile uint8_t*)(k_inline_addr_icu_ir + (uintptr_t)k_inline_icu_usbi0_vector);
  volatile uint8_t* const ier18 =
    (volatile uint8_t*)(k_inline_addr_icu_ier + (uintptr_t)k_inline_icu_ier_idx_usbi);

  *slibr144 = (uint8_t)k_inline_icu_usbi0_src;
  *sliprcr  = (uint8_t)k_inline_icu_sliprcr_wprc;
  /* HUM 15.7.7 step (6) bounded confirmation: WPRC latches in 1-2 ICLK
   * cycles; cap the poll so the boot path never spins forever (NASA
   * P10 Rule 2).  If WPRC fails to latch the IER enable below is a
   * no-op -- the ISR-entry counter diagnostic catches that case. */
  for (uint16_t i = 0; i < (uint16_t)k_inline_sliprcr_poll_max; i++) {
    if ((*sliprcr & (uint8_t)k_inline_icu_sliprcr_wprc) != 0U) {
      break;
    }
  }
  *ipr144 = (uint8_t)k_inline_icu_usbi_priority;
  *ir144  = 0U;
  *ier18 |= (uint8_t)(1U << (uint8_t)k_inline_icu_ier_bit_usbi);
}

/**
 * @brief Drive PB3 high as a pre-scheduler "main reached tx_kernel_enter" probe
 *
 * @details
 * PB3 (P4 pad 2, MCU pin 82, silkscreen EN3D) is driven HIGH in main BEFORE
 * tx_kernel_enter and later driven LOW by usb_task once it runs. An AD2 DIO7
 * probe on P4 pad 2 thus shows:
 *   HIGH = firmware reached main init but usb_task hasn't run
 *   LOW  = usb_task ran and set PB3 low
 *   0x0  = neither wrote (probe/wiring issue)
 *
 * @pre PORTB clocks active (default after reset)
 *
 * @post PB3 configured as GPIO output and driven HIGH
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see usb_task.c (drives PB3 LOW once running)
 *
 * @since Version 1.0.0
 */
static void internal_set_pb3_pre_kernel_probe(void)
{
  volatile uint8_t* const pb_pdr  = (volatile uint8_t*)k_inline_addr_pb_pdr;
  volatile uint8_t* const pb_podr = (volatile uint8_t*)k_inline_addr_pb_podr;
  volatile uint8_t* const pb_pmr  = (volatile uint8_t*)k_inline_addr_pb_pmr;
  *pb_pmr &= (uint8_t) ~(uint8_t)k_inline_bit_pb3;
  *pb_pdr |= (uint8_t)k_inline_bit_pb3;
  *pb_podr |= (uint8_t)k_inline_bit_pb3; /* HIGH */
}

/**
 * @brief Run the full inline USB0 bring-up sequence in the pre-kernel window
 *
 * @details
 * Composes the four extracted helpers in the only order the HUM allows:
 *   1. Module-stop release + clock + PHY (HUM 40.3.1.1)
 *   2. Default control pipe + EP interrupt enables (HUM 40 EP layout)
 *   3. ICU/SLIBR/IER wiring for USBI0 (HUM 15.7.7)
 *   4. PB3 diagnostic probe HIGH
 *
 * Kept as raw register pokes (mirrors rx_usb_hw.c) rather than calling
 * rx_usb_hw_init() so the very first PRCR/MSTPCR/SYSCFG writes run in the
 * single-threaded pre-kernel window. This lets the call to
 * rx_usb_hw_mark_initialized() afterwards safely tell rx_usb_init() to skip
 * its own redundant init pass. See cherry-pick 0abb79c54.
 *
 * @pre hardware_init() completed (peripheral clocks, GPIO already configured)
 * @pre rx_nanopb_init() completed (so the post-attach RX path is ready)
 *
 * @post USB0 module enabled, DCP configured, USBI0 ICU vector wired
 * @post DPRPU asserted (host enumeration in flight)
 * @post PB3 driven HIGH for AD2 visibility
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see internal_inline_usb0_clock_and_phy()
 * @see internal_inline_usb0_endpoint_setup()
 * @see internal_inline_usb0_icu_setup()
 * @see internal_set_pb3_pre_kernel_probe()
 *
 * @since Version 1.0.0
 */
static void internal_inline_usb0_bringup(void)
{
  /* Inline USB0 bring-up sequence -- raw register pokes that mirror
   * libs/rx_usb/src/rx_usb_hw.c.  Kept inline (rather than inside
   * rx_usb_hw_init()) so the very first PRCR/MSTPCR/SYSCFG writes run
   * in the single-threaded pre-kernel window and the call to
   * rx_usb_hw_mark_initialized() below can safely tell rx_usb_init()
   * to skip its own redundant init pass.  See cherry-pick 0abb79c54. */
  internal_inline_usb0_clock_and_phy();
  internal_inline_usb0_endpoint_setup();
  internal_inline_usb0_icu_setup();
  internal_set_pb3_pre_kernel_probe();
}

/**
 * @brief Light D9 + run startup-flag bookkeeping (boot phase 1)
 *
 * @details
 * Drives `internal_init_boot_checkpoint_leds()` (which lights D9 = PA7 to
 * announce that main() ran), inspects the post-reset RSTSR flags, and walks
 * the D9 -> D10 LED transition that means "startup-flag check completed".
 * RSTSR diagnostics are deliberately NOT printed here because UART is not
 * up yet -- they are buffered for `internal_report_startup_flags()` to
 * emit once the UART comes online.
 *
 *
 * @pre System reset has just completed (single-threaded pre-scheduler context)
 * @pre PA7/PB0 GPIO writes succeed (boot-checkpoint LEDs already configured)
 *
 * @post D9 (PA7) lit, D10 (PB0) lit on success (startup-flag check completed)
 * @post Startup-flag state captured for later report
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_main_boot_checkpoint_init(void)
{
  /* BRING-UP CHECKPOINTS -- "one hot" LED indicator of how far boot got
   * without any UART. See internal_init_boot_checkpoint_leds() for the
   * complete D9-D13 mapping table. */
  internal_init_boot_checkpoint_leds();

  /* Check startup flags (bring-up: never halt; diagnostic printed later). */
  const rx_err_t ret = internal_check_startup_flags();
  if (ret != k_rx_ok) {
    return ret;
  }

  (void)gpio_write_low(k_rx_pa_7);
  (void)gpio_write_high(k_rx_pb_0); /* D10: startup flags checked */
  return k_rx_ok;
}

/**
 * @brief Bring up clocks, then early UART, then drain the buffered RSTSR report
 *
 * @details
 * Phase 2 of boot. Calls `rx_clock_power_init()` to configure ICLK/PCLK
 * (LED transitions D10 -> D11), then `uart_debug_init()` to bring up the
 * debug UART. If UART came up, prints the boot banner and the buffered
 * startup-flag diagnostic from phase 1, then walks D11 -> D12. If UART
 * failed, the LED stays at D11 and the failure code propagates so the
 * caller can `RX_ERROR_CHECK()` it.
 *
 *
 * @pre `internal_main_boot_checkpoint_init()` ran (D10 already lit)
 *
 * @post Clocks programmed, debug UART up (success path)
 * @post D12 (P7_2) lit on full success; D11 stays on UART failure
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_main_clocks_and_uart(void)
{
  /* Initialize system clocks and power management */
  rx_err_t ret = rx_clock_power_init();
  if (ret != k_rx_ok) {
    return ret; /* If this fails, errors cant be logged */
  }

