Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  (void)gpio_write_low(k_rx_pb_0);
  (void)gpio_write_high(k_rx_p7_1); /* D11: clock init done */

  /* ========================================================================
   * EARLY UART INITIALIZATION - Enable error logging ASAP
   * ======================================================================== */
  ret = uart_debug_init();

  /* Report startup flags to console (only if UART initialized successfully) */
  if (ret == k_rx_ok) {
    uart_debug_puts("\r\n=== STAR RX72N BOOT ===\r\n");
    internal_report_startup_flags();
    (void)gpio_write_low(k_rx_p7_1);
    (void)gpio_write_high(k_rx_p7_2); /* D12: UART init OK */
  }

  /* Return UART init status - caller will halt if failed, but at least
   * tried to report flags first. */
  return ret;
}

/**
 * @brief Initialize infrastructure, peripheral hardware, and the nanopb wrapper
 *
 * @details
 * Phase 3 of boot. Calls (in order):
 *   1. `rx_infrastructure_init()` -- error handler + pin validator
 *   2. `hardware_init()` -- GPIO, GPTW, timers, UART, SPI, I2C, ADC
 *   3. `rx_nanopb_init()` -- pure-software wrapper used by telemetry_task
 *      and comm_task (without it both return `k_rx_err_not_initialized`).
 * Walks the D12 -> D13 LED transition between hardware_init() and
 * rx_nanopb_init().
 *
 *
 * @pre `internal_main_clocks_and_uart()` succeeded (clocks + UART online)
 *
 * @post All three subsystems initialized (success path)
 * @post D13 (PB1) lit on full success
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_main_init_hw_modules(void)
{
  /* Initialize infrastructure (error handler + pin validator) before peripherals.
   * Must run in single-threaded context before ThreadX starts. */
  rx_err_t ret = rx_infrastructure_init();
  if (ret != k_rx_ok) {
    return ret;
  }

  /* Initialize application-specific hardware (GPIO, GPTW, timers, UART, SPI, I2C, ADC) */
  ret = hardware_init();
  if (ret != k_rx_ok) {
    return ret;
  }

  (void)gpio_write_low(k_rx_p7_2);
  (void)gpio_write_high(k_rx_pb_1); /* D13: hardware_init done */

  /* Enable the nanopb wrapper so telemetry_task's rx_nanopb_encode_*()
   * and comm_task's rx_nanopb_decode_*() stop returning
   * k_rx_err_not_initialized (0x10F). The wrapper is a pure software
   * module with no hardware deps, so initialize it during the
   * pre-kernel single-threaded window next to the other module inits. */
  return rx_nanopb_init();
}

/**
 * @brief Run the inline USB0 bring-up and finalize the rx_usb subsystem
 *
 * @details
 * Phase 4 of boot. Composes `internal_inline_usb0_bringup()` (HUM 40.3.1.1
 * clock + PHY -> EP setup -> HUM 15.7.7 ICU wiring -> PB3 diagnostic) with
 * the rx_usb finalization pair: `rx_usb_hw_mark_initialized()` followed by
 * `rx_usb_init(nullptr)`. The mark step tells the production rx_usb_hw layer
 * that the inline sequence already attached the hardware so rx_usb_init()
 * skips its redundant register sequence and only sets up ring buffers, CDC
 * class state, and flips `s_usb.initialized = true`. Without this finalize,
 * rx_usb_write() early-exits with `k_rx_err_invalid_state` and telemetry
 * never reaches the host.
 *
 *
 * @pre `internal_main_init_hw_modules()` succeeded (peripheral clocks ready)
 *
 * @post USB0 attached, host enumeration in flight (DPRPU asserted)
 * @post `s_usb.initialized = true` so rx_usb_write() is unblocked
 *
 * @note Executes single-threaded before scheduler start; no synchronization needed.
 *
 * @see internal_inline_usb0_bringup() Composed inline bring-up
 * @see rx_usb_init() Software-side ring buffer + CDC state setup
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_main_init_usb_subsystem(void)
{
  /* Pre-kernel inline USB0 bring-up: HUM 40.3.1.1 clock + PHY -> EP setup ->
   * HUM 15.7.7 ICU wiring -> PB3 diagnostic. See helper for the full narrative. */
  internal_inline_usb0_bringup();

  /* Hardware is now fully attached by the inline sequence above.  Tell
   * the production rx_usb_hw layer that s_hw_initialized = true so
   * rx_usb_init below skips the redundant register sequence, then call
   * rx_usb_init() to set up ring buffers, CDC class state, and flip
   * s_usb.initialized = true.  Without this, rx_usb_write() early-exits
   * with k_rx_err_invalid_state and telemetry never reaches the host. */
  rx_usb_hw_mark_initialized();
  return rx_usb_init(nullptr);
}

/**
 * @brief Park the CPU in a low-power wait if `tx_kernel_enter()` ever returns
 *
 * @details
 * `tx_kernel_enter()` is documented as no-return; reaching code after it
 * means the ThreadX scheduler failed to start, which is a fatal state with
 * no safe recovery. Spin in `wait` (low-power idle) so a watchdog or
 * debugger probe can observe the condition. The trailing
 * `__builtin_unreachable()` lets the compiler omit the function epilogue.
 *
 * @pre `tx_kernel_enter()` has been called and (impossibly) returned
 *
 * @post CPU parked in `wait` loop indefinitely
 *
 * @note Marked NORETURN-equivalent via `__builtin_unreachable()` to silence
 *       static-analysis warnings about a non-returning path through main.
 *
 * @since Version 1.0.0
 */
static void internal_main_post_kernel_halt(void)
{
  /* Should never reach here, ThreadX scheduler failed to start if it does */
  while (1) {
    __asm__ volatile("wait"); /* Wait for sleep/idle */
  }

  /* Unreachable: ThreadX scheduler takes over before reaching this point.
   * If execution reaches here, the system is in an undefined state. */
  __builtin_unreachable();
}

int main(void)
{
  rx_err_t ret = internal_main_boot_checkpoint_init();
  RX_ERROR_CHECK(ret);

  ret = internal_main_clocks_and_uart();
  RX_ERROR_CHECK(ret);

  ret = internal_main_init_hw_modules();
  RX_ERROR_CHECK(ret);

  ret = internal_main_init_usb_subsystem();
  RX_ERROR_CHECK(ret);

  /* Start the ThreadX scheduler - should never return */
  tx_kernel_enter();

  internal_main_post_kernel_halt();

  return k_main_ret_success;
}
